
                                            <p>&#x5148;&#x4E0A;&#x7ED3;&#x8BBA;&#xFF1A;</p>

<p>&#x6DF1;&#x62F7;&#x8D1D;&#xFF1A;&#x62F7;&#x8D1D;&#x7684;&#x662F;&#x6307;&#x9488;&#x6240;&#x6307;&#x5411;&#x7684;&#x4E00;&#x6574;&#x5757;&#x5185;&#x5B58;&#xFF0C;&#x5373;&#x5C06;&#x6307;&#x9488;pSrc&#x6240;&#x6307;&#x5411;&#x7684;&#x4E00;&#x6574;&#x5757;&#x5185;&#x5B58;&#xFF0C;&#x62F7;&#x8D1D;&#x51FA;&#x6765;&#xFF0C;&#x7136;&#x540E;&#x8D4B;&#x503C;&#x7ED9;&#x6307;&#x9488;pDst&#x6240;&#x6307;&#x5411;&#x7684;&#x4E00;&#x4E2A;&#x533A;&#x57DF;&#xFF0C;&#x6838;&#x5FC3;&#x4EE3;&#x7801;&#x662F;</p>

<pre class="has"><code>char* pDst = new char[128];
memcpy(pDst, pSrc, sizeof(pSrc));</code></pre>

<p>&#x6D45;&#x62F7;&#x8D1D;&#xFF1A;&#x62F7;&#x8D1D;&#x7684;&#x662F;&#x6307;&#x9488;&#x7684;&#x503C;&#xFF0C;&#x5373;&#x5C06;&#x6307;&#x9488;pSrc&#x8D4B;&#x503C;&#x7ED9;&#x4E86;pDst</p>

<pre class="has"><code>char* pDst = nullptr;
pDst = pSrc;</code></pre>

<p><strong>&#x603B;&#x7ED3;&#xFF1A;&#x6D45;&#x62F7;&#x8D1D;&#x53EA;&#x662F;&#x5BF9;&#x6307;&#x9488;&#x7684;&#x62F7;&#x8D1D;&#xFF0C;&#x62F7;&#x8D1D;&#x540E;&#x4E24;&#x4E2A;&#x6307;&#x9488;&#x6307;&#x5411;&#x540C;&#x4E00;&#x4E2A;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#xFF1B;&#x6DF1;&#x62F7;&#x8D1D;&#x4E0D;&#x4F46;&#x5BF9;&#x6307;&#x9488;&#x8FDB;&#x884C;&#x62F7;&#x8D1D;&#xFF0C;&#x800C;&#x4E14;&#x5BF9;&#x6307;&#x9488;&#x6307;&#x5411;&#x7684;&#x5185;&#x5BB9;&#x8FDB;&#x884C;&#x62F7;&#x8D1D;&#xFF0C;&#x7ECF;&#x6DF1;&#x62F7;&#x8D1D;&#x540E;&#x7684;&#x6307;&#x9488;&#x662F;&#x6307;&#x5411;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x5730;&#x5740;&#x7684;&#x6307;&#x9488;&#x3002;</strong></p>

<p>&#x518D;&#x8BF4;&#x51E0;&#x53E5;&#xFF1A;</p>

<p>&#x5F53;&#x5BF9;&#x8C61;&#x4E2D;&#x5B58;&#x5728;&#x6307;&#x9488;&#x6210;&#x5458;&#x65F6;&#xFF0C;&#x9664;&#x4E86;&#x5728;&#x590D;&#x5236;&#x5BF9;&#x8C61;&#x65F6;&#x9700;&#x8981;&#x8003;&#x8651;&#x81EA;&#x5B9A;&#x4E49;&#x62F7;&#x8D1D;&#x6784;&#x9020;&#x51FD;&#x6570;&#xFF0C;&#x8FD8;&#x5E94;&#x8BE5;&#x8003;&#x8651;&#x4EE5;&#x4E0B;&#x4E24;&#x79CD;&#x60C5;&#x5F62;&#xFF1A;</p>

<p>1.<strong>&#x5F53;&#x51FD;&#x6570;&#x7684;&#x53C2;&#x6570;&#x4E3A;&#x5BF9;&#x8C61;&#x65F6;</strong>&#xFF0C;&#x5B9E;&#x53C2;&#x4F20;&#x9012;&#x7ED9;&#x5F62;&#x53C2;&#x7684;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x5B9E;&#x53C2;&#x7684;&#x4E00;&#x4E2A;&#x62F7;&#x8D1D;&#x5BF9;&#x8C61;&#xFF0C;&#x7CFB;&#x7EDF;&#x81EA;&#x52A8;&#x901A;&#x8FC7;&#x62F7;&#x8D1D;&#x6784;&#x9020;&#x51FD;&#x6570;&#x5B9E;&#x73B0;&#xFF1B;</p>

<p>2.<strong>&#x5F53;&#x51FD;&#x6570;&#x7684;&#x8FD4;&#x56DE;&#x503C;&#x4E3A;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x65F6;</strong>&#xFF0C;&#x8BE5;&#x5BF9;&#x8C61;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x51FD;&#x6570;&#x5185;&#x5BF9;&#x8C61;&#x7684;&#x4E00;&#x4E2A;&#x62F7;&#x8D1D;&#xFF0C;&#x7528;&#x4E8E;&#x8FD4;&#x56DE;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x5904;&#x3002;</p>

<p>&#x5E94;&#x7528;&#x573A;&#x666F;&#xFF1A;</p>

<p style="margin-left:10px;"><span style="color:#4b4b4b;">&#x5F53;&#x7528;&#x4E00;&#x4E2A;&#x5DF2;&#x521D;&#x59CB;&#x5316;&#x8FC7;&#x4E86;&#x7684;&#x81EA;&#x5B9A;&#x4E49;&#x7C7B;&#x7C7B;&#x578B;&#x5BF9;&#x8C61;&#x53BB;&#x521D;&#x59CB;&#x5316;&#x53E6;&#x4E00;&#x4E2A;&#x65B0;&#x6784;&#x9020;&#x7684;&#x5BF9;&#x8C61;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x62F7;&#x8D1D;&#x6784;&#x9020;&#x51FD;&#x6570;&#x5C31;&#x4F1A;&#x88AB;&#x81EA;&#x52A8;&#x8C03;&#x7528;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5F53;&#x7C7B;&#x7684;&#x5BF9;&#x8C61;&#x9700;&#x8981;&#x62F7;&#x8D1D;&#x65F6;&#xFF0C;&#x62F7;&#x8D1D;&#x6784;&#x9020;&#x51FD;&#x6570;&#x5C06;&#x4F1A;&#x88AB;&#x8C03;&#x7528;&#x3002;&#x4EE5;&#x4E0B;&#x60C5;&#x51B5;&#x90FD;&#x4F1A;&#x8C03;&#x7528;&#x62F7;&#x8D1D;&#x6784;&#x9020;&#x51FD;&#x6570;&#xFF1A;<br>
&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x4EE5;&#x503C;&#x4F20;&#x9012;&#x7684;&#x65B9;&#x5F0F;&#x4F20;&#x5165;&#x51FD;&#x6570;&#x4F53;&#xA0;<br>
&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x4EE5;&#x503C;&#x4F20;&#x9012;&#x7684;&#x65B9;&#x5F0F;&#x4ECE;&#x51FD;&#x6570;&#x8FD4;&#x56DE;&#xA0;<br>
&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x8FDB;&#x884C;&#x521D;&#x59CB;&#x5316;&#x3002;</span></p>

<p style="margin-left:10px;"><span style="color:#4b4b4b;">&#x5982;&#x679C;&#x5728;&#x7C7B;&#x4E2D;&#x6CA1;&#x6709;&#x663E;&#x5F0F;&#x5730;&#x58F0;&#x660E;&#x4E00;&#x4E2A;&#x62F7;&#x8D1D;&#x6784;&#x9020;&#x51FD;&#x6570;&#xFF0C;&#x90A3;&#x4E48;&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x5C06;&#x4F1A;&#x81EA;&#x52A8;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x9ED8;&#x8BA4;&#x7684;&#x62F7;&#x8D1D;&#x6784;&#x9020;&#x51FD;&#x6570;&#xFF0C;&#x8BE5;&#x6784;&#x9020;&#x51FD;&#x6570;&#x5B8C;&#x6210;&#x5BF9;&#x8C61;&#x4E4B;&#x95F4;&#x7684;&#x4F4D;&#x62F7;&#x8D1D;&#x3002;&#x4F4D;&#x62F7;&#x8D1D;&#x53C8;&#x79F0;&#x6D45;&#x62F7;&#x8D1D;&#xFF0C;&#x540E;&#x9762;&#x5C06;&#x8FDB;&#x884C;&#x8BF4;&#x660E;&#x3002;</span></p>

<p style="margin-left:10px;"><span style="color:#4b4b4b;">&#x81EA;&#x5B9A;&#x4E49;&#x62F7;&#x8D1D;&#x6784;&#x9020;&#x51FD;&#x6570;&#x662F;&#x4E00;&#x79CD;&#x826F;&#x597D;&#x7684;&#x7F16;&#x7A0B;&#x98CE;&#x683C;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x963B;&#x6B62;&#x7F16;&#x8BD1;&#x5668;&#x5F62;&#x6210;&#x9ED8;&#x8BA4;&#x7684;&#x62F7;&#x8D1D;&#x6784;&#x9020;&#x51FD;&#x6570;&#xFF0C;&#x63D0;&#x9AD8;&#x6E90;&#x7801;&#x6548;&#x7387;&#x3002;</span></p>

<p>&#xA0;</p>                                    