
                                            <p>&#x5148;&#x4E0A;&#x7ED3;&#x8BBA;&#xFF1A;</p>

<p>&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x7A7A;&#x7C7B;&#xFF0C;&#x5176;&#x5B9E;&#x4F8B;&#x5316;&#x7684;&#x5BF9;&#x8C61;&#x5360;&#x5185;&#x5B58;&#x4E3A;1byte&#x3002;</p>

<p>&#x5BF9;&#x4E8E;&#x975E;&#x7A7A;&#x7684;&#x7C7B;&#x6765;&#x8BF4;&#xFF0C;&#x5176;&#x5B9E;&#x4F8B;&#x5316;&#x5BF9;&#x8C61;&#x4E2D;&#xFF0C;&#x5360;&#x5185;&#x5B58;&#x7684;&#x53EA;&#x6709;2&#x4E2A;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x7C7B;&#x5185;&#x975E;&#x9759;&#x6001;&#x6210;&#x5458;&#x53D8;&#x91CF;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x662F;&#x865A;&#x51FD;&#x6570;&#x6307;&#x9488;&#x3002;</p>

<p>&#x8BE6;&#x7EC6;&#x5206;&#x6790;&#xFF1A;</p>

<p>&#x6210;&#x5458;&#x51FD;&#x6570;&#x8FD8;&#x662F;&#x4EE5;&#x4E00;&#x822C;&#x7684;&#x51FD;&#x6570;&#x4E00;&#x6837;&#x7684;&#x5B58;&#x5728;&#x3002;a.fun()&#x662F;&#x901A;&#x8FC7;fun(a.this)&#x6765;&#x8C03;&#x7528;&#x7684;&#x3002;&#x6240;&#x8C13;&#x6210;&#x5458;&#x51FD;&#x6570;&#x53EA;&#x662F;&#x5728;&#x540D;&#x4E49;&#x4E0A;&#x662F;&#x7C7B;&#x91CC;&#x7684;&#x3002;&#x5176;&#x5B9E;&#x6210;&#x5458;&#x51FD;&#x6570;&#x7684;&#x5927;&#x5C0F;&#x4E0D;&#x5728;&#x7C7B;&#x7684;&#x5BF9;&#x8C61;&#x91CC;&#x9762;&#xFF0C;&#x540C;&#x4E00;&#x4E2A;&#x7C7B;&#x7684;&#x591A;&#x4E2A;&#x5BF9;&#x8C61;&#x5171;&#x4EAB;&#x51FD;&#x6570;&#x4EE3;&#x7801;&#x3002;&#x800C;&#x6211;&#x4EEC;&#x8BBF;&#x95EE;&#x7C7B;&#x7684;&#x6210;&#x5458;&#x51FD;&#x6570;&#x662F;&#x901A;&#x8FC7;&#x7C7B;&#x91CC;&#x9762;&#x7684;&#x4E00;&#x4E2A;&#x6307;&#x9488;&#x5B9E;&#x73B0;&#xFF0C;&#x800C;&#x8FD9;&#x4E2A;&#x6307;&#x9488;&#x6307;&#x5411;&#x7684;&#x662F;&#x4E00;&#x4E2A;table&#xFF0C;table&#x91CC;&#x9762;&#x8BB0;&#x5F55;&#x7684;&#x5404;&#x4E2A;&#x6210;&#x5458;&#x51FD;&#x6570;&#x7684;&#x5730;&#x5740;&#xFF08;&#x5F53;&#x7136;&#x4E0D;&#x540C;&#x7684;&#x7F16;&#x8BD1;&#x53EF;&#x80FD;&#x7565;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x5B9E;&#x73B0;&#xFF09;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x8BBF;&#x95EE;&#x6210;&#x5458;&#x51FD;&#x6570;&#x662F;&#x95F4;&#x63A5;&#x83B7;&#x5F97;&#x5730;&#x5740;&#x7684;&#x3002;&#x6240;&#x4EE5;&#x8FD9;&#x6837;&#x4E5F;&#x5C31;&#x589E;&#x52A0;&#x4E86;&#x4E00;&#x5B9A;&#x7684;&#x65F6;&#x95F4;&#x5F00;&#x9500;&#xFF0C;&#x8FD9;&#x4E5F;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4EEC;&#x63D0;&#x5021;&#x628A;&#x4E00;&#x4E9B;&#x7B80;&#x77ED;&#x7684;&#xFF0C;&#x8C03;&#x7528;&#x9891;&#x7387;&#x9AD8;&#x7684;&#x51FD;&#x6570;&#x58F0;&#x660E;&#x4E3A;inline&#x5F62;&#x5F0F;&#xFF08;&#x5185;&#x8054;&#x51FD;&#x6570;&#xFF09;&#x3002;</p>

<p>(&#x4E00;)<br>
class CBase&#xA0;<br>
{&#xA0;<br>
};&#xA0;<br>
sizeof(CBase)=1&#xFF1B;</p>

<p>&#x4E3A;&#x4EC0;&#x4E48;&#x7A7A;&#x7684;&#x4EC0;&#x4E48;&#x90FD;&#x6CA1;&#x6709;&#x662F;1&#x5462;&#xFF1F;<br>
c++&#x8981;&#x6C42;&#x6BCF;&#x4E2A;&#x5B9E;&#x4F8B;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x90FD;&#x6709;&#x72EC;&#x4E00;&#x65E0;&#x4E8C;&#x7684;&#x5730;&#x5740;&#x3002;//&#x6CE8;&#x610F;&#x8FD9;&#x53E5;&#x8BDD;&#xFF01;&#xFF01;&#xFF01;&#xFF01;&#xFF01;&#xFF01;&#xFF01;&#xFF01;&#xFF01;&#xFF01;<br>
&#x7A7A;&#x7C7B;&#x4E5F;&#x4F1A;&#x88AB;&#x5B9E;&#x4F8B;&#x5316;&#xFF0C;&#x6240;&#x4EE5;&#x7F16;&#x8BD1;&#x5668;&#x4F1A;&#x7ED9;&#x7A7A;&#x7C7B;&#x9690;&#x542B;&#x7684;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x8FD9;&#x6837;&#x7A7A;&#x7C7B;&#x5B9E;&#x4F8B;&#x5316;&#x4E4B;&#x540E;&#x5C31;&#x6709;&#x4E86;&#x72EC;&#x4E00;&#x65E0;&#x4E8C;&#x7684;&#x5730;&#x5740;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#x7A7A;&#x7C7B;&#x7684;sizeof&#x4E3A;1&#x3002;</p>

<p>(&#x4E8C;)</p>

<p>class CBase&#xA0;<br>
{&#xA0;<br>
int a;&#xA0;<br>
char p;&#xA0;<br>
};&#xA0;<br>
sizeof(CBase)=8;<br>
&#x8BB0;&#x5F97;&#x5BF9;&#x9F50;&#x7684;&#x95EE;&#x9898;&#x3002;int &#x5360;4&#x5B57;&#x8282;//&#x6CE8;&#x610F;&#x8FD9;&#x70B9;&#x548C;struct&#x7684;&#x5BF9;&#x9F50;&#x539F;&#x5219;&#x5F88;&#x50CF;&#xFF01;&#xFF01;&#xFF01;&#xFF01;&#xFF01;<br>
char&#x5360;&#x4E00;&#x5B57;&#x8282;&#xFF0C;&#x8865;&#x9F50;3&#x5B57;&#x8282;</p>

<p>(&#x4E09;)<br>
class CBase&#xA0;<br>
{&#xA0;<br>
public:&#xA0;<br>
CBase(void);&#xA0;<br>
virtual ~CBase(void);&#xA0;<br>
private:&#xA0;<br>
int&#xA0; a;&#xA0;<br>
char *p;&#xA0;<br>
};&#xA0;<br>
&#x518D;&#x8FD0;&#x884C;&#xFF1A;sizeof(CBase)=12</p>

<p>C++ &#x7C7B;&#x4E2D;&#x6709;&#x865A;&#x51FD;&#x6570;&#x7684;&#x65F6;&#x5019;&#x6709;&#x4E00;&#x4E2A;&#x6307;&#x5411;&#x865A;&#x51FD;&#x6570;&#x7684;&#x6307;&#x9488;&#xFF08;vptr&#xFF09;&#xFF0C;&#x5728;32&#x4F4D;&#x7CFB;&#x7EDF;&#x5206;&#x914D;&#x6307;&#x9488;&#x5927;&#x5C0F;&#x4E3A;4&#x5B57;&#x8282;&#x3002;&#x65E0;&#x8BBA;&#x591A;&#x5C11;&#x4E2A;&#x865A;&#x51FD;&#x6570;&#xFF0C;&#x53EA;&#x6709;&#x8FD9;&#x4E00;&#x4E2A;&#x6307;&#x9488;&#xFF0C;4&#x5B57;&#x8282;&#x3002;//&#x6CE8;&#x610F;&#x4E00;&#x822C;&#x7684;&#x51FD;&#x6570;&#x662F;&#x6CA1;&#x6709;&#x8FD9;&#x4E2A;&#x6307;&#x9488;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x4E5F;&#x4E0D;&#x5360;&#x7C7B;&#x7684;&#x5185;&#x5B58;&#x3002;</p>

<p>(&#x56DB;)<br>
class CChild : public CBase&#xA0;<br>
{&#xA0;<br>
public:&#xA0;<br>
CChild(void);&#xA0;<br>
~CChild(void);&#xA0;</p>

<p>virtual void test();<br>
private:&#xA0;<br>
int b;&#xA0;<br>
};&#xA0;<br>
&#x8F93;&#x51FA;&#xFF1A;sizeof(CChild)=16&#xFF1B;<br>
&#x53EF;&#x89C1;&#x5B50;&#x7C7B;&#x7684;&#x5927;&#x5C0F;&#x662F;&#x672C;&#x8EAB;&#x6210;&#x5458;&#x53D8;&#x91CF;&#x7684;&#x5927;&#x5C0F;&#x52A0;&#x4E0A;&#x7236;&#x7C7B;&#x7684;&#x5927;&#x5C0F;&#x3002;//&#x5176;&#x4E2D;&#x6709;&#x4E00;&#x90E8;&#x5206;&#x662F;&#x865A;&#x62DF;&#x51FD;&#x6570;&#x8868;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x77E5;&#x9053;</p>

<p>&#x7236;&#x7C7B;&#x5B50;&#x7C7B;&#x5171;&#x4EAB;&#x4E00;&#x4E2A;&#x865A;&#x51FD;&#x6570;&#x6307;&#x9488;</p>

<p>(&#x4E94;)</p>

<p>#include&lt;iostream.h&gt;</p>

<p>class a {};</p>

<p>class b{};</p>

<p>class c:public a{</p>

<p>virtual void fun()=0;</p>

<p>};</p>

<p>class d:public b,public c{};</p>

<p>int main()</p>

<p>{</p>

<p>cout&lt;&lt;&quot;sizeof(a)&quot;&lt;&lt;sizeof(a)&lt;&lt;endl;</p>

<p>cout&lt;&lt;&quot;sizeof(b)&quot;&lt;&lt;sizeof(b)&lt;&lt;endl;</p>

<p>cout&lt;&lt;&quot;sizeof(c)&quot;&lt;&lt;sizeof(c)&lt;&lt;endl;</p>

<p>cout&lt;&lt;&quot;sizeof(d)&quot;&lt;&lt;sizeof(d)&lt;&lt;endl;</p>

<p>return 0;}</p>

<p>&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x7684;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x4E3A;&#xFF1A;</p>

<p>sizeof(a) =1</p>

<p>sizeof(b)=1</p>

<p>sizeof(c)=4</p>

<p>sizeof(d)=8</p>

<p>&#x524D;&#x4E09;&#x79CD;&#x60C5;&#x51B5;&#x6BD4;&#x8F83;&#x5E38;&#x89C1;&#xFF0C;&#x6CE8;&#x610F;&#x7B2C;&#x56DB;&#x79CD;&#x60C5;&#x51B5;&#x3002;&#x7C7B;d&#x7684;&#x5927;&#x5C0F;&#x66F4;&#x8BA9;&#x521D;&#x5B66;&#x8005;&#x7591;&#x60D1;&#x5427;&#xFF0C;&#x7C7B;d&#x662F;&#x7531;&#x7C7B;b&#xFF0C;c&#x6D3E;&#x751F;&#x8FE9;&#x6765;&#x7684;&#xFF0C;&#x5B83;&#x7684;&#x5927;&#x5C0F;&#x5E94;&#x8BE5;&#x4E3A;&#x4E8C;&#x8005;&#x4E4B;&#x548C;5&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x5374;&#x662F;8 &#x5462;&#xFF1F;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x4E3A;&#x4E86;&#x63D0;&#x9AD8;&#x5B9E;&#x4F8B;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x5B58;&#x53D6;&#x6548;&#x7387;&#xFF0E;&#x7C7B;&#x7684;&#x5927;&#x5C0F;&#x5F80;&#x5F80;&#x88AB;&#x8C03;&#x6574;&#x5230;&#x7CFB;&#x7EDF;&#x7684;&#x6574;&#x6570;&#x500D;&#xFF0E;&#x5E76;&#x91C7;&#x53D6;&#x5C31;&#x8FD1;&#x7684;&#x6CD5;&#x5219;&#xFF0C;&#x91CC;&#x54EA;&#x4E2A;&#x6700;&#x8FD1;&#x7684;&#x500D;&#x6570;&#xFF0C;&#x5C31;&#x662F;&#x8BE5;&#x7C7B;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x6240;&#x4EE5;&#x7C7B;d&#x7684;&#x5927;&#x5C0F;&#x4E3A;8&#x4E2A;&#x5B57;&#x8282;&#xFF0E;</p>

<p>&#x603B;&#x7ED3;&#xFF1A;</p>

<p>&#x7A7A;&#x7684;&#x7C7B;&#x662F;&#x4F1A;&#x5360;&#x7528;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x5927;&#x5C0F;&#x662F;1&#xFF0C;&#x539F;&#x56E0;&#x662F;C++&#x8981;&#x6C42;&#x6BCF;&#x4E2A;&#x5B9E;&#x4F8B;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x90FD;&#x6709;&#x72EC;&#x4E00;&#x65E0;&#x4E8C;&#x7684;&#x5730;&#x5740;&#x3002;</p>

<p>&#xFF08;&#x4E00;&#xFF09;&#x7C7B;&#x5185;&#x90E8;&#x7684;&#x6210;&#x5458;&#x53D8;&#x91CF;&#xFF1A;</p>

<ul><li>&#x666E;&#x901A;&#x7684;&#x53D8;&#x91CF;&#xFF1A;&#x662F;&#x8981;&#x5360;&#x7528;&#x5185;&#x5B58;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x8981;&#x6CE8;&#x610F;&#x5BF9;&#x9F50;&#x539F;&#x5219;&#xFF08;&#x8FD9;&#x70B9;&#x548C;struct&#x7C7B;&#x578B;&#x5F88;&#x76F8;&#x4F3C;&#xFF09;&#x3002;</li>
	<li>static&#x4FEE;&#x9970;&#x7684;&#x9759;&#x6001;&#x53D8;&#x91CF;&#xFF1A;&#x4E0D;&#x5360;&#x7528;&#x5185;&#x5BB9;&#xFF0C;&#x539F;&#x56E0;&#x662F;&#x7F16;&#x8BD1;&#x5668;&#x5C06;&#x5176;&#x653E;&#x5728;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x533A;&#x3002;</li>
</ul><p>&#xFF08;&#x4E8C;&#xFF09;&#x7C7B;&#x5185;&#x90E8;&#x7684;&#x6210;&#x5458;&#x51FD;&#x6570;&#xFF1A;</p>

<ul><li>&#x666E;&#x901A;&#x51FD;&#x6570;&#xFF1A;&#x4E0D;&#x5360;&#x7528;&#x5185;&#x5B58;&#x3002;</li>
	<li>&#x865A;&#x51FD;&#x6570;&#xFF1A;&#x8981;&#x5360;&#x7528;4&#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x7528;&#x6765;&#x6307;&#x5B9A;&#x865A;&#x51FD;&#x6570;&#x7684;&#x865A;&#x62DF;&#x51FD;&#x6570;&#x8868;&#x7684;&#x5165;&#x53E3;&#x5730;&#x5740;&#x3002;&#x6240;&#x4EE5;&#x4E00;&#x4E2A;&#x7C7B;&#x7684;&#x865A;&#x51FD;&#x6570;&#x6240;&#x5360;&#x7528;&#x7684;&#x5730;&#x5740;&#x662F;&#x4E0D;&#x53D8;&#x7684;&#xFF0C;&#x548C;&#x865A;&#x51FD;&#x6570;&#x7684;&#x4E2A;&#x6570;&#x662F;&#x6CA1;&#x6709;&#x5173;&#x7CFB;&#x7684;</li>
</ul>                                    