
                    <!-- flowchart 箭头图标 勿删 -->
                    <svg xmlns="http://www.w3.org/2000/svg" style="display: none;">
                        <path stroke-linecap="round" d="M5,0 0,2.5 5,5z" id="raphael-marker-block" style="-webkit-tap-highlight-color: rgba(0, 0, 0, 0);"/>
                    </svg>
                                            <p>&#x5E94;&#x7528;MFC&#x6700;&#x5173;&#x952E;&#x7684;&#x5C31;&#x662F;&#x7A97;&#x53E3;&#x7684;&#x521B;&#x5EFA;&#x4E0E;&#x9500;&#x6BC1;&#xFF0C;&#x90A3;&#x4E48;&#x5728;&#x8FD9;&#x4E2A;&#x4E24;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#x90FD;&#x53D1;&#x751F;&#x4E86;&#x4E00;&#x4E9B;&#x4EC0;&#x4E48;&#x5462;&#xFF1F; <br>
1&#xFF0C;&#x521B;&#x5EFA; <br>
&#x521B;&#x5EFA;&#x6A21;&#x6001;&#x7A97;&#x53E3;&#xFF1A;</p>



<pre class="prettyprint"><code class=" hljs cs"><span class="hljs-comment">//&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x6A21;&#x6001;&#x5BF9;&#x8BDD;&#x6846;  </span>
CTestDialog td;  
td.DoModal(); </code></pre>

<p>&#x5907;&#x6CE8;&#xFF1A; <br>
        &#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5C40;&#x90E8;&#x6A21;&#x6001;&#x5BF9;&#x8BDD;&#x6846;&#x7C7B;&#x53D8;&#x91CF;&#xFF0C;&#x4E0D;&#x7528;&#x62C5;&#x5FC3;&#x5B83;&#x4F1A;&#x968F;&#x7740;&#x6240;&#x5728;&#x51FD;&#x6570;&#x8FD4;&#x56DE;&#x800C;&#x88AB;&#x9500;&#x6BC1;&#x3002;&#x56E0;&#x4E3A;DoModal()&#x51FD;&#x6570;&#x7684;&#x4E00;&#x4E2A;&#x529F;&#x80FD;&#x662F;&#xFF0C;&#x5F53;&#x524D;&#x53EA;&#x80FD;&#x8FD0;&#x884C;&#x6B64;&#x6A21;&#x6001;&#x5BF9;&#x8BDD;&#x6846;&#xFF0C;&#x4E14;&#x505C;&#x6B62;&#x4E3B;&#x7A97;&#x53E3;&#x7684;&#x8FD0;&#x884C;&#xFF0C;&#x76F4;&#x5230;&#x6A21;&#x6001;&#x5BF9;&#x8BDD;&#x6846;&#x9000;&#x51FA;&#xFF0C;&#x624D;&#x5141;&#x8BB8;&#x4E3B;&#x7A97;&#x53E3;&#x8FD0;&#x884C;&#x3002; <br>
        DoModal()&#x51FD;&#x6570;&#x4E5F;&#x6709;&#x663E;&#x793A;&#x5BF9;&#x8BDD;&#x6846;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x6240;&#x4EE5;&#x4E5F;&#x65E0;&#x9700;&#x8C03;&#x7528;&#x5176;&#x4ED6;&#x51FD;&#x6570;&#x6765;&#x663E;&#x793A;&#x5BF9;&#x8BDD;&#x6846;&#x3002; <br>
&#x521B;&#x5EFA;&#x975E;&#x6478;&#x6001;&#x7A97;&#x53E3;&#xFF1A; <br>
&#x9996;&#x5148;&#x5728;&#x4F60;&#x6240;&#x8981;&#x7F16;&#x5199;&#x7684;&#x7C7B;&#x7684;&#x5934;&#x6587;&#x4EF6;&#x4E2D;&#x58F0;&#x660E;&#x4E00;&#x4E2A;&#x6307;&#x9488;&#x53D8;&#x91CF;&#xFF1A;</p>

<pre class="prettyprint"><code class=" hljs cs"><span class="hljs-keyword">private</span>:  
    CTestDialog *pTD;  </code></pre>

<p>&#x7136;&#x540E;&#x518D;&#x5728;&#x76F8;&#x5E94;&#x7684;CPP&#x6587;&#x4EF6;&#x4E2D;</p>



<pre class="prettyprint"><code class=" hljs lasso"><span class="hljs-comment">//&#x91C7;&#x7528;&#x6210;&#x5458;&#x53D8;&#x91CF;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x975E;&#x6A21;&#x6001;&#x5BF9;&#x8BDD;</span>
pTD <span class="hljs-subst">=</span> <span class="hljs-literal">new</span> CTestDialog(); <span class="hljs-comment">//&#x7ED9;&#x6307;&#x9488;&#x5206;&#x914D;&#x5185;&#x5B58;  </span>
pTD<span class="hljs-subst">-&gt;</span>Create(IDD_DIALOG1); <span class="hljs-comment">//&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x975E;&#x6A21;&#x6001;&#x5BF9;&#x8BDD;&#x6846;  </span>
pTD<span class="hljs-subst">-&gt;</span>ShowWindow(SW_SHOWNORMAL); <span class="hljs-comment">//&#x663E;&#x793A;&#x975E;&#x6A21;&#x6001;&#x5BF9;&#x8BDD;&#x6846;</span></code></pre>

<p>&#x6700;&#x540E;&#x5728;&#x7C7B;&#x7684;&#x6790;&#x6784;&#x51FD;&#x6570;&#x4E2D;&#x6536;&#x56DE;pTD&#x6240;&#x6307;&#x5411;&#x7684;&#x5185;&#x5B58;&#xFF1A;</p>



<pre class="prettyprint"><code class=" hljs sql"><span class="hljs-operator"><span class="hljs-keyword">delete</span> pTD;</span>  </code></pre>

<p>&#x5907;&#x6CE8;&#xFF1A; <br>
&#x70B9;&#x51FB;&#x975E;&#x6A21;&#x6001;&#x5BF9;&#x8BDD;&#x6846;&#x4E2D;&#x7684;OK&#x6309;&#x94AE;&#xFF0C;&#x975E;&#x6A21;&#x6001;&#x5BF9;&#x8BDD;&#x6846;&#x6CA1;&#x6709;&#x9500;&#x6BC1;&#xFF0C;&#x53EA;&#x662F;&#x9690;&#x85CF;&#x4E86;&#x3002;&#x82E5;&#x60F3;&#x70B9;&#x51FB;OK&#x6309;&#x94AE;&#x65F6;&#xFF0C;&#x975E;&#x6A21;&#x6001;&#x5BF9;&#x8BDD;&#x6846;&#x4E5F;&#x9500;&#x6BC1;&#xFF0C;&#x90A3;&#x4E48;CTestDialog&#x7C7B;&#x5FC5;&#x987B;&#x91CD;&#x8F7D;&#x5176;&#x57FA;&#x7C7B;CDialog&#x7684;&#x865A;&#x51FD;&#x6570;OnOK()&#xFF0C;&#x5728;&#x6B64;&#x51FD;&#x6570;&#x91CC;&#x8C03;&#x7528;DestroyWindow()&#x6765;&#x9500;&#x6BC1;&#x6B64;&#x5BF9;&#x8BDD;&#x6846;&#x3002; <br>
2&#xFF0C;&#x521B;&#x5EFA;&#x4E4B;&#x540E; <br>
&#x9996;&#x5148;OnCreate()&#xFF1A; <br>
&#x54CD;&#x5E94;WM_CREATE&#x6D88;&#x606F;&#xFF08;&#x5373;OnCreate&#xFF09;&#x7684;&#x65F6;&#x5019;&#x7A97;&#x53E3;&#x8FD8;&#x6CA1;&#x6709;&#x5EFA;&#x7ACB;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x7ED9;&#x6210;&#x5458;&#x53D8;&#x91CF;&#x8D4B;&#x503C;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4FEE;&#x6539;&#x7A97;&#x53E3;&#x7684;&#x57FA;&#x672C;&#x5185;&#x5BB9;&#x6BD4;&#x5982;&#x98CE;&#x683C;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x80FD;&#x5BF9;&#x7A97;&#x53E3;&#x63A7;&#x4EF6;&#x64CD;&#x4F5C;&#xFF0C;&#x56E0;&#x4E3A;&#x7A97;&#x53E3;&#x8FD8;&#x6CA1;&#x6709;&#x5EFA;&#x7ACB;&#x3002; <br>
 &#x5728;&#x54CD;&#x5E94;WM_CREATE&#x6D88;&#x606F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5BF9;&#x8BDD;&#x6846;&#x53CA;&#x5B50;&#x63A7;&#x4EF6;&#x8FD8;&#x672A;&#x521B;&#x5EFA;&#x5B8C;&#x6210;&#xFF0C;&#x4EA6;&#x662F;&#x8BF4;&#x53EA;&#x662F;&#x901A;&#x77E5;&#x7CFB;&#x7EDF;&#x8BF4;&#x8981;&#x5F00;&#x59CB;&#x521B;&#x5EFA;&#x7A97;&#x53E3;&#x5566;&#xFF0C;&#x8FD9;&#x4E2A;&#x6D88;&#x606F;&#x54CD;&#x5E94;&#x5B8C;&#x4E4B;&#x540E;&#xFF0C;&#x5BF9;&#x8BDD;&#x6846;&#x548C;&#x5B50;&#x63A7;&#x4EF6;&#x624D;&#x5F00;&#x59CB;&#x521B;&#x5EFA;&#x3002;&#x56E0;&#x6B64;&#x5728;&#x6B64;&#x6D88;&#x606F;&#x54CD;&#x5E94;&#x51FD;&#x6570;&#x4E2D;&#x65E0;&#x6CD5;&#x5BF9;&#x63A7;&#x4EF6;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#x548C;&#x521D;&#x59CB;&#x5316;&#x3002; <br>
&#x8FD9;&#x6761;&#x6D88;&#x606F;&#x8868;&#x793A;&#x4E00;&#x4E2A;&#x7A97;&#x53E3;&#x6B63;&#x5728;&#x751F;&#x6210;&#x3002; <br>
&#x7136;&#x540E;OnInitDialog()&#xFF1A; <br>
&#x54CD;&#x5E94;WM_INITDIALOG&#x6D88;&#x606F;&#xFF08;&#x5373;OnInitDialog&#xFF09;&#x65F6;&#x5019;&#x7A97;&#x53E3;&#x5DF2;&#x7ECF;&#x5EFA;&#x7ACB;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x79FB;&#x52A8;&#x7A97;&#x53E3;&#xFF0C;&#x4FEE;&#x6539;&#x98CE;&#x683C;&#x7B49;&#x7B49;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x7ED9;&#x6210;&#x5458;&#x53D8;&#x91CF;&#x8D4B;&#x503C;&#x3002; <br>
 WM_INITDIALOG&#x6D88;&#x606F;&#x54CD;&#x5E94;&#x51FD;&#x6570;&#x662F;&#x5728;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x5F53;&#x5176;&#x5BF9;&#x8BDD;&#x6846;&#x548C;&#x5B50;&#x63A7;&#x4EF6;&#x5168;&#x90E8;&#x521B;&#x5EFA;&#x5B8C;&#x6BD5;&#xFF0C;&#x5C06;&#x8981;&#x663E;&#x793A;&#x5185;&#x5BB9;&#x7684;&#x65F6;&#x5019;&#x53D1;&#x9001;&#x7684;&#x6D88;&#x606F;&#x3002;&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x5728;WM_INITDIALOG&#x6D88;&#x606F;&#x54CD;&#x5E94;&#x51FD;&#x6570;&#x4E2D;&#x6DFB;&#x52A0;&#x5BF9;&#x7F16;&#x8F91;&#x6846;&#x63A7;&#x4EF6;&#x7684;&#x521D;&#x59CB;&#x5316;&#x548C;&#x4FEE;&#x6539;&#x3002; <br>
&#x8FD9;&#x6761;&#x6D88;&#x606F;&#x662F;&#x5728;&#x5BF9;&#x8BDD;&#x6846;&#x5373;&#x5C06;&#x663E;&#x793A;&#x4E4B;&#x524D;&#xFF0C;&#x5728;Create&#xFF0C;CreateIndirect&#x6216;DoModal&#x8C03;&#x7528;&#x671F;&#x95F4;&#x53D1;&#x51FA;&#x7684;&#x3002;  <br>
&#x6700;&#x540E;OnShowWindow()&#xFF1A; <br>
&#x5F53;CWnd&#x5BF9;&#x8C61;&#x8981;&#x88AB;&#x663E;&#x793A;&#x6216;&#x9690;&#x85CF;&#x65F6;&#xFF0C;&#x6846;&#x67B6;&#x8C03;&#x7528;&#x8FD9;&#x4E2A;&#x6210;&#x5458;&#x51FD;&#x6570;&#x3002;&#x5F53;&#x8C03;&#x7528;ShowWindow&#x6210;&#x5458;&#x51FD;&#x6570;&#x65F6;&#xFF0C;&#x6216;&#x8005;&#x91CD;&#x53E0;&#x7A97;&#x53E3;&#x88AB;&#x6700;&#x5927;&#x5316;&#x6216;&#x590D;&#x539F;&#xFF0C;&#x6216;&#x8005;&#x91CD;&#x53E0;&#x5F0F;&#x6216;&#x5F39;&#x51FA;&#x5F0F;&#x7A97;&#x53E3;&#x88AB;&#x5173;&#x95ED;&#xFF08;&#x53D8;&#x4E3A;&#x56FE;&#x6807;&#xFF09;&#x6216;&#x6253;&#x5F00;&#xFF08;&#x88AB;&#x663E;&#x793A;&#xFF09;&#x65F6;&#xFF0C;&#x7A97;&#x53E3;&#x88AB;&#x663E;&#x793A;&#x6216;&#x9690;&#x85CF;&#x3002;&#x5F53;&#x91CD;&#x53E0;&#x7A97;&#x53E3;&#x88AB;&#x5173;&#x95ED;&#x65F6;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x4E0E;&#x6B64;&#x7A97;&#x53E3;&#x76F8;&#x5173;&#x7684;&#x6240;&#x6709;&#x5F39;&#x51FA;&#x7A97;&#x53E3;&#x90FD;&#x88AB;&#x9690;&#x85CF;&#x3002; <br>
3&#xFF0C;&#x5173;&#x95ED; <br>
OnClose()&#xFF1A; <br>
&#x6D88;&#x606F;&#x54CD;&#x5E94;&#x51FD;&#x6570;&#xFF0C;&#x54CD;&#x5E94;WM_CLOSE&#x6D88;&#x606F;&#xFF0C;&#x70B9;&#x51FB;&#x754C;&#x9762;&#x4E0A;&#x7684;&#x201C;&#x5173;&#x95ED;&#x201D;&#x6309;&#x94AE;&#x8C03;&#x7528;&#x3002; <br>
OnDestroy()&#xFF1A; <br>
&#x6D88;&#x606F;&#x54CD;&#x5E94;&#x51FD;&#x6570;&#xFF0C;&#x54CD;&#x5E94;WM_DESTROY&#x6D88;&#x606F;&#xFF0C;&#x5F53;&#x4E00;&#x4E2A;&#x7A97;&#x53E3;&#x5373;&#x5C06;&#x88AB;&#x9500;&#x6BC1;&#x65F6;&#xFF0C;&#x88AB;&#x53D1;&#x9001;&#x3002; <br>
OnNcDestroy() &#xFF1A; <br>
&#x6D88;&#x606F;&#x54CD;&#x5E94;&#x51FD;&#x6570;&#xFF0C;&#x54CD;&#x5E94;WM_NCDESTROY&#x6D88;&#x606F;&#xFF0C;&#x5F53;&#x4E00;&#x4E2A;&#x7A97;&#x53E3;&#x88AB;&#x9500;&#x6BC1;&#x4EE5;&#x540E;&#x88AB;&#x53D1;&#x9001;&#x3002;</p>                                    