
                    <!-- flowchart 箭头图标 勿删 -->
                    <svg xmlns="http://www.w3.org/2000/svg" style="display: none;">
                        <path stroke-linecap="round" d="M5,0 0,2.5 5,5z" id="raphael-marker-block" style="-webkit-tap-highlight-color: rgba(0, 0, 0, 0);"/>
                    </svg>
                                            <p>&#x6700;&#x8FD1;&#x4E00;&#x76F4;&#x5728;&#x505A;MFC&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x754C;&#x9762;&#x60F3;&#x8981;&#x505A;&#x7684;&#x51FA;&#x8272;&#xFF0C;&#x7A97;&#x53E3;&#x4E00;&#x5B9A;&#x8981;&#x64CD;&#x4F5C;&#x719F;&#x7EC3;&#xFF0C;&#x90A3;&#x5C31;&#x5F97;&#x4F9D;&#x9760;&#x7A97;&#x53E3;&#x7684;&#x53E5;&#x67C4;&#x4E86;&#x3002; <br>
&#x8F6C;&#x8F7D;&#x4E86;&#x4E00;&#x4E0B;&#x5F97;&#x5230;&#x7A97;&#x53E3;&#x53E5;&#x67C4;&#x7684;&#x51E0;&#x79CD;&#x65B9;&#x6CD5;&#xFF1A; <br>
AfxGetMainWnd <br>
AfxGetMainWnd&#x83B7;&#x53D6;&#x81EA;&#x8EAB;&#x7A97;&#x53E3;&#x53E5;&#x67C4; <br>
HWND hWnd = AfxGetMainWnd()-&gt;m_hWnd;</p>

<p>GetTopWindow <br>
&#x51FD;&#x6570;&#x529F;&#x80FD;&#xFF1A;&#x8BE5;&#x51FD;&#x6570;&#x68C0;&#x67E5;&#x4E0E;&#x7279;&#x5B9A;&#x7236;&#x7A97;&#x53E3;&#x76F8;&#x8054;&#x7684;&#x5B50;&#x7A97;&#x53E3;z&#x5E8F;&#xFF08;Z&#x5E8F;&#xFF1A;&#x5782;&#x76F4;&#x5C4F;&#x5E55;&#x7684;&#x65B9;&#x5411;&#xFF0C;&#x5373;&#x53E0;&#x653E;&#x6B21;&#x5E8F;&#xFF09;&#xFF0C;&#x5E76;&#x8FD4;&#x56DE;&#x5728;z&#x5E8F;&#x9876;&#x90E8;&#x7684;&#x5B50;&#x7A97;&#x53E3;&#x7684;&#x53E5;&#x67C4;&#x3002; <br>
&#x51FD;&#x6570;&#x539F;&#x578B;&#xFF1A;HWND GetTopWindow&#xFF08;HWND hWnd&#xFF09;&#xFF1B; <br>
&#x53C2;&#x6570;&#xFF1A; <br>
&#x3000;&#x3000;hWnd:&#x88AB;&#x67E5;&#x5E8F;&#x7684;&#x7236;&#x7A97;&#x53E3;&#x7684;&#x53E5;&#x67C4;&#x3002;&#x5982;&#x679C;&#x8BE5;&#x53C2;&#x6570;&#x4E3A;NULL&#xFF0C;&#x51FD;&#x6570;&#x8FD4;&#x56DE;Z&#x5E8F;&#x9876;&#x90E8;&#x7684;&#x7A97;&#x53E3;&#x53E5;&#x67C4;&#x3002; <br>
&#x8FD4;&#x56DE;&#x503C;&#xFF1A; <br>
    &#x5982;&#x679C;&#x51FD;&#x6570;&#x6210;&#x529F;&#xFF0C;&#x8FD4;&#x56DE;&#x503C;&#x4E3A;&#x5728;Z&#x5E8F;&#x9876;&#x90E8;&#x7684;&#x5B50;&#x7A97;&#x53E3;&#x53E5;&#x67C4;&#x3002;&#x5982;&#x679C;&#x6307;&#x5B9A;&#x7684;&#x7A97;&#x53E3;&#x65E0;&#x5B50;&#x7A97;&#x53E3;&#xFF0C;&#x8FD4;&#x56DE;&#x503C;&#x4E3A;NULL&#x3002;</p>

<p>GetForegroundWindow <br>
&#x51FD;&#x6570;&#x529F;&#x80FD;&#xFF1A;&#x8BE5;&#x51FD;&#x6570;&#x8FD4;&#x56DE;&#x5F53;&#x524D;&#x7CFB;&#x7EDF;&#x7684;&#x524D;&#x53F0;&#x7A97;&#x53E3;&#x7684;&#x7A97;&#x53E3;&#x53E5;&#x67C4;&#x3002; <br>
&#x51FD;&#x6570;&#x539F;&#x578B;&#xFF1A;HWND GetForegroundWindow&#xFF08;VOID&#xFF09;&#x3000;&#x3000; <br>
&#x8FD4;&#x56DE;&#x503C;&#xFF1A;&#x51FD;&#x6570;&#x8FD4;&#x56DE;&#x524D;&#x53F0;&#x7A97;&#x56DE;&#x7684;&#x53E5;&#x67C4;&#x3002;</p>

<p>GetActiveWindow</p>

<p>&#x51FD;&#x6570;&#x529F;&#x80FD;&#xFF1A;&#x8BE5;&#x51FD;&#x6570;&#x53EF;&#x4EE5;&#x83B7;&#x5F97;&#x4E0E;&#x8C03;&#x7528;&#x8BE5;&#x65B9;&#x6CD5;&#x7684;&#x7EBF;&#x7A0B;&#x7684;&#x6D88;&#x606F;&#x961F;&#x5217;&#x76F8;&#x5173;&#x7684;&#x6D3B;&#x52A8;&#x7A97;&#x53E3;&#x7684;&#x7A97;&#x53E3;&#x53E5;&#x67C4;&#xFF08;&#x5C31;&#x662F;&#x53D6;&#x5F97;&#x5F53;&#x524D;&#x8FDB;&#x7A0B;&#x7684;&#x6D3B;&#x52A8;&#x7A97;&#x53E3;&#x7684;&#x7A97;&#x53E3;&#x53E5;&#x67C4;&#xFF09;&#x3002; <br>
&#x51FD;&#x6570;&#x539F;&#x578B;&#xFF1A;HWND GetActiveWindow&#xFF08;VOID&#xFF09; <br>
&#x8FD4;&#x56DE;&#x503C;&#xFF1A;&#x8FD4;&#x56DE;&#x503C;&#x662F;&#x4E0E;&#x8C03;&#x7528;&#x7EBF;&#x7A0B;&#x7684;&#x6D88;&#x606F;&#x961F;&#x5217;&#x76F8;&#x5173;&#x7684;&#x6D3B;&#x52A8;&#x7A97;&#x53E3;&#x7684;&#x53E5;&#x67C4;&#x3002;&#x5426;&#x5219;&#xFF0C;&#x8FD4;&#x56DE;&#x503C;&#x4E3A;NULL&#x3002;</p>

<p>GetSafeHwnd <br>
&#x51FD;&#x6570;&#x529F;&#x80FD;&#xFF1A;&#x83B7;&#x53D6;&#x67D0;&#x4E2A;&#x7A97;&#x53E3;&#x5BF9;&#x8C61;&#xFF08;CWnd&#x7684;&#x6D3E;&#x751F;&#x5BF9;&#x8C61;&#xFF09;&#x6307;&#x9488;&#x7684;&#x53E5;&#x67C4;&#xFF08;HWND&#xFF09;&#x65F6;&#xFF0C;&#x6700;&#x5B89;&#x5168;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x4F7F;&#x7528;GetSafeHwnd()&#x51FD;&#x6570;&#x3002; <br>
&#x901A;&#x8FC7;&#x4E0B;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x6765;&#x770B;&#x5176;&#x7406;&#x7531;&#xFF1A; <br>
&#x3000;&#x3000;CWnd *pwnd = FindWindow(&#x201C;ExploreWClass&#x201D;,NULL); //&#x5E0C;&#x671B;&#x627E;&#x5230;&#x8D44;&#x6E90;&#x7BA1;&#x7406;&#x5668; <br>
&#x3000;&#x3000;HWND hwnd = pwnd-&gt;m_hwnd; //&#x5F97;&#x5230;&#x5B83;&#x7684;HWND <br>
&#x3000;&#x3000;&#x8FD9;&#x6837;&#x7684;&#x4EE3;&#x7801;&#x5F53;&#x5F00;&#x59CB;&#x5F97;&#x5230;&#x7684;pwnd&#x4E3A;&#x7A7A;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x4F1A;&#x51FA;&#x73B0;&#x4E00;&#x4E2A;&#x201C;General protection error&#x201D;,&#x5E76;&#x5173;&#x95ED;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x56E0;&#x4E3A;&#x4E00;&#x822C;&#x4E0D;&#x80FD;&#x5BF9;&#x4E00;&#x4E2A;NULL&#x6307;&#x9488;&#x8BBF;&#x95EE;&#x5176;&#x6210;&#x5458;&#xFF0C;&#x5982;&#x679C;&#x7528;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#xFF1A; <br>
&#x3000;&#x3000;CWnd *pwnd = FindWindow(&#x201C;ExploreWClass&#x201D;,NULL); //&#x5E0C;&#x671B;&#x627E;&#x5230;&#x8D44;&#x6E90;&#x7BA1;&#x7406;&#x5668; <br>
&#x3000;&#x3000;HWND hwnd = pwnd-&gt;GetSafeHwnd(); //&#x5F97;&#x5230;&#x5B83;&#x7684;HWND <br>
&#x3000;&#x3000;&#x5C31;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x4E3A;&#x5C3D;&#x7BA1;&#x5F53;pwnd&#x662F;NULL&#x65F6;&#xFF0C;GetSafeHwnd&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x7528;&#xFF0C;&#x53EA;&#x662F;&#x8FD4;&#x56DE;NULL</p>

<p>IsWindowVisible <br>
&#x51FD;&#x6570;&#x529F;&#x80FD;&#xFF1A;&#x8BE5;&#x51FD;&#x6570;&#x83B7;&#x5F97;&#x7ED9;&#x5B9A;&#x7A97;&#x53E3;&#x7684;&#x53EF;&#x89C6;&#x72B6;&#x6001;&#x3002; <br>
&#x51FD;&#x6570;&#x539F;&#x578B;&#xFF1A;BOOL IsWindowVisible&#xFF08;HWND hWnd&#xFF09;&#xFF1B; <br>
&#x53C2;&#x6570;&#xFF1B; <br>
&#x3000;&#x3000;hWnd&#xFF1A;&#x88AB;&#x6D4B;&#x8BD5;&#x7A97;&#x53E3;&#x7684;&#x53E5;&#x67C4;&#x3002; <br>
&#x8FD4;&#x56DE;&#x503C;&#xFF1A; <br>
    &#x5982;&#x679C;&#x6307;&#x5B9A;&#x7684;&#x7A97;&#x53E3;&#x53CA;&#x5176;&#x7236;&#x7A97;&#x53E3;&#x5177;&#x6709;WS_VISIBLE&#x98CE;&#x683C;&#xFF0C;&#x8FD4;&#x56DE;&#x503C;&#x4E3A;&#x975E;&#x96F6;&#xFF1B;&#x5982;&#x679C;&#x6307;&#x5B9A;&#x7684;&#x7A97;&#x53E3;&#x53CA;&#x5176;&#x7236;&#x7A97;&#x53E3;&#x4E0D;&#x5177;&#x6709;WS_VISIBLE&#x98CE;&#x683C;&#xFF0C;&#x8FD4;&#x56DE;&#x503C;&#x4E3A;&#x96F6;&#x3002;&#x7531;&#x4E8E;&#x8FD4;&#x56DE;&#x503C;&#x8868;&#x660E;&#x4E86;&#x7A97;&#x53E3;&#x662F;&#x5426;&#x5177;&#x6709;Ws_VISIBLE&#x98CE;&#x683C;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x5373;&#x4F7F;&#x8BE5;&#x7A97;&#x53E3;&#x88AB;&#x5176;&#x4ED6;&#x7A97;&#x53E3;&#x906E;&#x76D6;&#xFF0C;&#x51FD;&#x6570;&#x8FD4;&#x56DE;&#x503C;&#x4E5F;&#x4E3A;&#x975E;&#x96F6;&#x3002; <br>
&#x5907;&#x6CE8;&#xFF1A; <br>
    &#x7A97;&#x53E3;&#x7684;&#x53EF;&#x89C6;&#x72B6;&#x6001;&#x7531;WS_VISIBLE&#x4F4D;&#x6307;&#x793A;&#x3002;&#x5F53;&#x8BBE;&#x7F6E;&#x4E86;WS_VISIBLE&#x4F4D;&#xFF0C;&#x7A97;&#x53E3;&#x5C31;&#x53EF;&#x663E;&#x793A;&#xFF0C;&#x800C;&#x4E14;&#x53EA;&#x8981;&#x7A97;&#x53E3;&#x5177;&#x6709;WS_VISIBLE&#x98CE;&#x683C;&#xFF0C;&#x4EFB;&#x4F55;&#x753B;&#x5728;&#x7A97;&#x53E3;&#x7684;&#x4FE1;&#x606F;&#x90FD;&#x5C06;&#x88AB;&#x663E;&#x793A;&#x3002;</p>

<p>IsWindow&#xFF1A; <br>
&#x51FD;&#x6570;&#x529F;&#x80FD;&#xFF1A;&#x8BE5;&#x51FD;&#x6570;&#x786E;&#x5B9A;&#x7ED9;&#x5B9A;&#x7684;&#x7A97;&#x53E3;&#x53E5;&#x67C4;&#x662F;&#x5426;&#x6807;&#x793A;&#x4E00;&#x4E2A;&#x5DF2;&#x5B58;&#x5728;&#x7684;&#x7A97;&#x53E3;&#x3002;&#x3000; <br>
&#x51FD;&#x6570;&#x539F;&#x578B;&#xFF1A;BOOL IsWindow&#xFF08;HWND hWnd&#xFF09;&#xFF1B; <br>
&#x53C2;&#x6570;&#xFF1A; <br>
    hWnd:&#x88AB;&#x6D4B;&#x8BD5;&#x7A97;&#x53E3;&#x7684;&#x53E5;&#x67C4;&#x3002; <br>
&#x8FD4;&#x56DE;&#x503C;&#xFF1A; <br>
    &#x5982;&#x679C;&#x7A97;&#x53E3;&#x53E5;&#x67C4;&#x6807;&#x8BC6;&#x4E86;&#x4E00;&#x4E2A;&#x5DF2;&#x5B58;&#x5728;&#x7684;&#x7A97;&#x53E3;&#xFF0C;&#x8FD4;&#x56DE;&#x503C;&#x4E3A;TURE&#xFF1B;&#x5982;&#x679C;&#x7A97;&#x53E3;&#x53E5;&#x67C4;&#x672A;&#x6807;&#x8BC6;&#x4E00;&#x4E2A;&#x5DF2;&#x5B58;&#x5728;&#x7A97;&#x53E3;&#xFF0C;&#x8FD4;&#x56DE;&#x503C;&#x4E3A;FALSE&#x3002;</p>

<p>FindWindow&#xFF1A; <br>
HWND FindWindow(LPCSTR lpClassName,LPCSTR lpWindowName ); <br>
&#x53C2;&#x6570;&#xFF1A; <br>
lpClassName <br>
&#x3000;&#x3000;&#x6307;&#x5411;&#x4E00;&#x4E2A;&#x4EE5;null&#x7ED3;&#x5C3E;&#x7684;&#x3001;&#x7528;&#x6765;&#x6307;&#x5B9A;&#x7C7B;&#x540D;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x6216;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x786E;&#x5B9A;&#x7C7B;&#x540D;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x539F;&#x5B50;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x53C2;&#x6570;&#x662F;&#x4E00;&#x4E2A;&#x539F;&#x5B50;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x5FC5;&#x987B;&#x662F;&#x4E00;&#x4E2A;&#x5728;&#x8C03;&#x7528;&#x6B64;&#x51FD;&#x6570;&#x524D;&#x5DF2;&#x7ECF;&#x901A;&#x8FC7;GlobalAddAtom&#x51FD;&#x6570;&#x521B;&#x5EFA;&#x597D;&#x7684;&#x5168;&#x5C40;&#x539F;&#x5B50;&#x3002;&#x8FD9;&#x4E2A;&#x539F;&#x5B50;&#xFF08;&#x4E00;&#x4E2A;16bit&#x7684;&#x503C;&#xFF09;&#xFF0C;&#x5FC5;&#x987B;&#x88AB;&#x653E;&#x7F6E;&#x5728;lpClassName&#x7684;&#x4F4E;&#x4F4D;&#x5B57;&#x8282;&#x4E2D;&#xFF0C;lpClassName&#x7684;&#x9AD8;&#x4F4D;&#x5B57;&#x8282;&#x7F6E;&#x96F6;&#x3002; <br>
lpWindowName <br>
&#x3000;&#x3000;&#x6307;&#x5411;&#x4E00;&#x4E2A;&#x4EE5;null&#x7ED3;&#x5C3E;&#x7684;&#x3001;&#x7528;&#x6765;&#x6307;&#x5B9A;&#x7A97;&#x53E3;&#x540D;&#xFF08;&#x5373;&#x7A97;&#x53E3;&#x6807;&#x9898;&#xFF09;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x3002;&#x5982;&#x679C;&#x6B64;&#x53C2;&#x6570;&#x4E3A;NULL&#xFF0C;&#x5219;&#x5339;&#x914D;&#x6240;&#x6709;&#x7A97;&#x53E3;&#x540D;&#x3002; <br>
&#x8FD4;&#x56DE;&#x503C;&#xFF1A; <br>
&#x5982;&#x679C;&#x51FD;&#x6570;&#x6267;&#x884C;&#x6210;&#x529F;&#xFF0C;&#x5219;&#x8FD4;&#x56DE;&#x503C;&#x662F;&#x62E5;&#x6709;&#x6307;&#x5B9A;&#x7A97;&#x53E3;&#x7C7B;&#x540D;&#x6216;&#x7A97;&#x53E3;&#x540D;&#x7684;&#x7A97;&#x53E3;&#x7684;&#x53E5;&#x67C4;&#x3002; <br>
&#x3000;&#x3000;&#x5982;&#x679C;&#x51FD;&#x6570;&#x6267;&#x884C;&#x5931;&#x8D25;&#xFF0C;&#x5219;&#x8FD4;&#x56DE;&#x503C;&#x4E3A; NULL &#x3002;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8C03;&#x7528;GetLastError&#x51FD;&#x6570;&#x83B7;&#x5F97;&#x66F4;&#x52A0;&#x8BE6;&#x7EC6;&#x7684;&#x9519;&#x8BEF;&#x4FE1;&#x606F;&#x3002;</p>

<p>SetWindowText&#xFF1A; <br>
&#x81F3;&#x4E8E;&#x7A97;&#x53E3;&#x6807;&#x9898;&#x7684;&#x6539;&#x53D8;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;SetWindowText&#x6765;&#x5B9E;&#x73B0; <br>
&#x6CE8;&#xFF1A;&#x5982;&#x679C;&#x7A97;&#x53E3;&#x672C;&#x8EAB;&#x5C5E;&#x6027;&#x662F;&#x4E0D;&#x663E;&#x793A;&#x6807;&#x9898;&#x7684;&#xFF0C;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x7684;&#x8C03;&#x7528;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x7A97;&#x53E3;&#x5C5E;&#x6027;&#x3002; <br>
//Set title for application&#x2019;s main frame window . <br>
AfxGetMainWnd ( ) -&gt; SetWindowText (_T(&#x201C;Application title&#x201D;) ) <br>
//Set title for View&#x2019;s MDI child frame window . <br>
GetParentFrame ( ) -&gt; SetWindowText (&#x201C;_T (&#x201C;MDI Child Frame new title&#x201D;) ) <br>
//Set title for dialog&#x2019;s push button control. <br>
GetDlgitem (IDC_BUTTON) -&gt; SetWindowText (_T (&#x201C;Button new title &#x201C;) )</p>                                    