
                                            <p>&#x8F6C;&#xFF1A;</p><p></p><p style="margin:10px auto;font-size:13px;line-height:20.8px;background-color:rgb(255,255,255);font-family:Verdana, Geneva, Arial, Helvetica, sans-serif;">&#x5B66;&#x4E60;&#x8FC7;Spring&#x6846;&#x67B6;&#x7684;&#x4EBA;&#x4E00;&#x5B9A;&#x90FD;&#x4F1A;&#x542C;&#x8FC7;Spring&#x7684;IoC(&#x63A7;&#x5236;&#x53CD;&#x8F6C;) &#x3001;DI(&#x4F9D;&#x8D56;&#x6CE8;&#x5165;)&#x8FD9;&#x4E24;&#x4E2A;&#x6982;&#x5FF5;&#xFF0C;&#x5BF9;&#x4E8E;&#x521D;&#x5B66;Spring&#x7684;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x603B;&#x89C9;&#x5F97;IoC &#x3001;DI&#x8FD9;&#x4E24;&#x4E2A;&#x6982;&#x5FF5;&#x662F;&#x6A21;&#x7CCA;&#x4E0D;&#x6E05;&#x7684;&#xFF0C;&#x662F;&#x5F88;&#x96BE;&#x7406;&#x89E3;&#x7684;&#xFF0C;&#x4ECA;&#x5929;&#x548C;&#x5927;&#x5BB6;&#x5206;&#x4EAB;&#x7F51;&#x4E0A;&#x7684;&#x4E00;&#x4E9B;&#x6280;&#x672F;&#x5927;&#x725B;&#x4EEC;&#x5BF9;Spring&#x6846;&#x67B6;&#x7684;IOC&#x7684;&#x7406;&#x89E3;&#x4EE5;&#x53CA;&#x8C08;&#x8C08;&#x6211;&#x5BF9;Spring Ioc&#x7684;&#x7406;&#x89E3;&#x3002;</p><h2 style="padding:0px;margin-top:10px;font-size:21px;line-height:20.8px;background-color:rgb(255,255,255);font-family:Verdana, Geneva, Arial, Helvetica, sans-serif;"><a></a>&#x4E00;&#x3001;&#x5206;&#x4EAB;Iteye&#x7684;&#x5F00;&#x6D9B;&#x5BF9;Ioc&#x7684;&#x7CBE;&#x5F69;&#x8BB2;&#x89E3;</h2><p style="margin:10px auto;font-size:13px;line-height:20.8px;background-color:rgb(255,255,255);font-family:Verdana, Geneva, Arial, Helvetica, sans-serif;">&#x3000;&#x3000;&#x9996;&#x5148;&#x8981;&#x5206;&#x4EAB;&#x7684;&#x662F;Iteye&#x7684;&#x5F00;&#x6D9B;&#x8FD9;&#x4F4D;&#x6280;&#x672F;&#x725B;&#x4EBA;&#x5BF9;Spring&#x6846;&#x67B6;&#x7684;IOC&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x5199;&#x5F97;&#x975E;&#x5E38;&#x901A;&#x4FD7;&#x6613;&#x61C2;&#xFF0C;&#x4EE5;&#x4E0B;&#x5185;&#x5BB9;&#x5168;&#x90E8;&#x6765;&#x81EA;&#x539F;&#x6587;&#xFF0C;&#x539F;&#x6587;&#x5730;&#x5740;&#xFF1A;http://jinnianshilongnian.iteye.com/blog/1413846</p><h3 style="padding:0px;font-size:16px;line-height:20.8px;background-color:rgb(255,255,255);font-family:Verdana, Geneva, Arial, Helvetica, sans-serif;"><a></a>1.1&#x3001;IoC&#x662F;&#x4EC0;&#x4E48;</h3><p style="margin:10px auto;font-size:14px;line-height:1.5em;background-color:rgb(255,255,255);font-family:verdana, arial, helvetica, sans-serif;">&#x3000;&#x3000;<span style="color:rgb(255,0,0);"><span style="font-weight:700;">Ioc&#x2014;Inversion of Control&#xFF0C;&#x5373;&#x201C;&#x63A7;&#x5236;&#x53CD;&#x8F6C;&#x201D;&#xFF0C;&#x4E0D;&#x662F;&#x4EC0;&#x4E48;&#x6280;&#x672F;&#xFF0C;&#x800C;&#x662F;&#x4E00;&#x79CD;&#x8BBE;&#x8BA1;&#x601D;&#x60F3;&#x3002;</span><span style="color:rgb(0,0,0);">&#x5728;Java&#x5F00;&#x53D1;&#x4E2D;&#xFF0C;<span style="color:rgb(255,0,0);"><span style="font-weight:700;">Ioc&#x610F;&#x5473;&#x7740;&#x5C06;&#x4F60;&#x8BBE;&#x8BA1;&#x597D;&#x7684;&#x5BF9;&#x8C61;&#x4EA4;&#x7ED9;&#x5BB9;&#x5668;&#x63A7;&#x5236;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4F20;&#x7EDF;&#x7684;&#x5728;&#x4F60;&#x7684;&#x5BF9;&#x8C61;&#x5185;&#x90E8;&#x76F4;&#x63A5;&#x63A7;&#x5236;&#x3002;</span></span></span></span>&#x5982;&#x4F55;&#x7406;&#x89E3;&#x597D;Ioc&#x5462;&#xFF1F;&#x7406;&#x89E3;&#x597D;Ioc&#x7684;&#x5173;&#x952E;&#x662F;&#x8981;&#x660E;&#x786E;&#x201C;&#x8C01;&#x63A7;&#x5236;&#x8C01;&#xFF0C;&#x63A7;&#x5236;&#x4EC0;&#x4E48;&#xFF0C;&#x4E3A;&#x4F55;&#x662F;&#x53CD;&#x8F6C;&#xFF08;&#x6709;&#x53CD;&#x8F6C;&#x5C31;&#x5E94;&#x8BE5;&#x6709;&#x6B63;&#x8F6C;&#x4E86;&#xFF09;&#xFF0C;&#x54EA;&#x4E9B;&#x65B9;&#x9762;&#x53CD;&#x8F6C;&#x4E86;&#x201D;&#xFF0C;&#x90A3;&#x6211;&#x4EEC;&#x6765;&#x6DF1;&#x5165;&#x5206;&#x6790;&#x4E00;&#x4E0B;&#xFF1A;</p><p style="margin:10px auto;font-size:14px;line-height:1.5em;background-color:rgb(255,255,255);font-family:verdana, arial, helvetica, sans-serif;">&#x3000;&#x3000;&#x25CF;<span style="line-height:1.5em;padding:0px;margin:0px;"><span style="color:rgb(255,0,0);">&#x8C01;&#x63A7;&#x5236;&#x8C01;&#xFF0C;&#x63A7;&#x5236;&#x4EC0;&#x4E48;</span>&#xFF1A;</span>&#x4F20;&#x7EDF;Java SE&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#xFF0C;&#x6211;&#x4EEC;&#x76F4;&#x63A5;&#x5728;&#x5BF9;&#x8C61;&#x5185;&#x90E8;&#x901A;&#x8FC7;new&#x8FDB;&#x884C;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#xFF0C;&#x662F;&#x7A0B;&#x5E8F;&#x4E3B;&#x52A8;&#x53BB;&#x521B;&#x5EFA;&#x4F9D;&#x8D56;&#x5BF9;&#x8C61;&#xFF1B;&#x800C;IoC&#x662F;&#x6709;&#x4E13;&#x95E8;&#x4E00;&#x4E2A;&#x5BB9;&#x5668;&#x6765;&#x521B;&#x5EFA;&#x8FD9;&#x4E9B;&#x5BF9;&#x8C61;&#xFF0C;&#x5373;&#x7531;Ioc&#x5BB9;&#x5668;&#x6765;&#x63A7;&#x5236;&#x5BF9; &#x8C61;&#x7684;&#x521B;&#x5EFA;&#xFF1B;<span style="font-weight:700;"><span style="color:rgb(255,0,0);">&#x8C01;&#x63A7;&#x5236;&#x8C01;&#xFF1F;&#x5F53;&#x7136;&#x662F;IoC &#x5BB9;&#x5668;&#x63A7;&#x5236;&#x4E86;&#x5BF9;&#x8C61;&#xFF1B;&#x63A7;&#x5236;&#x4EC0;&#x4E48;&#xFF1F;&#x90A3;&#x5C31;&#x662F;&#x4E3B;&#x8981;&#x63A7;&#x5236;&#x4E86;&#x5916;&#x90E8;&#x8D44;&#x6E90;&#x83B7;&#x53D6;&#xFF08;&#x4E0D;&#x53EA;&#x662F;&#x5BF9;&#x8C61;&#x5305;&#x62EC;&#x6BD4;&#x5982;&#x6587;&#x4EF6;&#x7B49;&#xFF09;</span>&#x3002;</span></p><p style="margin:10px auto;font-size:14px;line-height:1.5em;background-color:rgb(255,255,255);font-family:verdana, arial, helvetica, sans-serif;">&#x3000;&#x3000;&#x25CF;<span style="line-height:1.5em;padding:0px;margin:0px;"><span style="color:rgb(255,0,0);">&#x4E3A;&#x4F55;&#x662F;&#x53CD;&#x8F6C;&#xFF0C;&#x54EA;&#x4E9B;&#x65B9;&#x9762;&#x53CD;&#x8F6C;&#x4E86;</span>&#xFF1A;</span>&#x6709;&#x53CD;&#x8F6C;&#x5C31;&#x6709;&#x6B63;&#x8F6C;&#xFF0C;&#x4F20;&#x7EDF;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x662F;&#x7531;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x5728;&#x5BF9;&#x8C61;&#x4E2D;&#x4E3B;&#x52A8;&#x63A7;&#x5236;&#x53BB;&#x76F4;&#x63A5;&#x83B7;&#x53D6;&#x4F9D;&#x8D56;&#x5BF9;&#x8C61;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6B63;&#x8F6C;&#xFF1B;&#x800C;&#x53CD;&#x8F6C;&#x5219;&#x662F;&#x7531;&#x5BB9;&#x5668;&#x6765;&#x5E2E;&#x5FD9;&#x521B;&#x5EFA;&#x53CA;&#x6CE8;&#x5165;&#x4F9D;&#x8D56;&#x5BF9;&#x8C61;&#xFF1B;&#x4E3A;&#x4F55;&#x662F;&#x53CD;&#x8F6C;&#xFF1F;<span style="color:rgb(255,0,0);"><span style="font-weight:700;">&#x56E0;&#x4E3A;&#x7531;&#x5BB9;&#x5668;&#x5E2E;&#x6211;&#x4EEC;&#x67E5;&#x627E;&#x53CA;&#x6CE8;&#x5165;&#x4F9D;&#x8D56;&#x5BF9;&#x8C61;&#xFF0C;&#x5BF9;&#x8C61;&#x53EA;&#x662F;&#x88AB;&#x52A8;&#x7684;&#x63A5;&#x53D7;&#x4F9D;&#x8D56;&#x5BF9;&#x8C61;&#xFF0C;&#x6240;&#x4EE5;&#x662F;&#x53CD;&#x8F6C;&#xFF1B;&#x54EA;&#x4E9B;&#x65B9;&#x9762;&#x53CD;&#x8F6C;&#x4E86;&#xFF1F;&#x4F9D;&#x8D56;&#x5BF9;&#x8C61;&#x7684;&#x83B7;&#x53D6;&#x88AB;&#x53CD;&#x8F6C;&#x4E86;&#x3002;</span></span></p><p style="margin:10px auto;font-size:14px;line-height:1.5em;background-color:rgb(255,255,255);font-family:verdana, arial, helvetica, sans-serif;">&#x3000;&#x3000;&#x7528;&#x56FE;&#x4F8B;&#x8BF4;&#x660E;&#x4E00;&#x4E0B;&#xFF0C;&#x4F20;&#x7EDF;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x5982;&#x56FE;2-1&#xFF0C;&#x90FD;&#x662F;&#x4E3B;&#x52A8;&#x53BB;&#x521B;&#x5EFA;&#x76F8;&#x5173;&#x5BF9;&#x8C61;&#x7136;&#x540E;&#x518D;&#x7EC4;&#x5408;&#x8D77;&#x6765;&#xFF1A;</p><p style="margin:10px auto;font-size:14px;line-height:1.5em;text-align:center;background-color:rgb(255,255,255);font-family:verdana, arial, helvetica, sans-serif;"><img src="http://images.cnitblog.com/blog/289233/201501/261421378318292.jpg" alt style="border:1px solid rgb(0,0,0);"></p><p style="margin:10px auto;font-size:14px;line-height:1.5em;text-align:center;background-color:rgb(255,255,255);font-family:verdana, arial, helvetica, sans-serif;">&#x56FE;1-1 &#x4F20;&#x7EDF;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x793A;&#x610F;&#x56FE;</p><p style="margin:10px auto;font-size:14px;line-height:1.5em;background-color:rgb(255,255,255);font-family:verdana, arial, helvetica, sans-serif;">&#x3000;&#x3000;&#x5F53;&#x6709;&#x4E86;IoC/DI&#x7684;&#x5BB9;&#x5668;&#x540E;&#xFF0C;&#x5728;&#x5BA2;&#x6237;&#x7AEF;&#x7C7B;&#x4E2D;&#x4E0D;&#x518D;&#x4E3B;&#x52A8;&#x53BB;&#x521B;&#x5EFA;&#x8FD9;&#x4E9B;&#x5BF9;&#x8C61;&#x4E86;&#xFF0C;&#x5982;&#x56FE;2-2&#x6240;&#x793A;:</p><p style="margin:10px auto;font-size:14px;line-height:1.5em;text-align:center;background-color:rgb(255,255,255);font-family:verdana, arial, helvetica, sans-serif;"></p><p style="margin:10px auto;font-size:14px;line-height:1.5em;text-align:center;background-color:rgb(255,255,255);font-family:verdana, arial, helvetica, sans-serif;">&#x56FE;1-2&#x6709;IoC/DI&#x5BB9;&#x5668;&#x540E;&#x7A0B;&#x5E8F;&#x7ED3;&#x6784;&#x793A;&#x610F;&#x56FE;</p><h3 style="padding:0px;font-size:16px;line-height:20.8px;background-color:rgb(255,255,255);font-family:Verdana, Geneva, Arial, Helvetica, sans-serif;"><a></a>1.2&#x3001;IoC&#x80FD;&#x505A;&#x4EC0;&#x4E48;</h3><p style="margin:10px auto;font-size:14px;line-height:1.5em;background-color:rgb(255,255,255);font-family:verdana, arial, helvetica, sans-serif;">&#x3000;&#x3000;IoC &#x4E0D;&#x662F;&#x4E00;&#x79CD;&#x6280;&#x672F;&#xFF0C;&#x53EA;&#x662F;&#x4E00;&#x79CD;&#x601D;&#x60F3;&#xFF0C;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;&#x7684;&#x6CD5;&#x5219;&#xFF0C;&#x5B83;&#x80FD;&#x6307;&#x5BFC;&#x6211;&#x4EEC;&#x5982;&#x4F55;&#x8BBE;&#x8BA1;&#x51FA;&#x677E;&#x8026;&#x5408;&#x3001;&#x66F4;&#x4F18;&#x826F;&#x7684;&#x7A0B;&#x5E8F;&#x3002;&#x4F20;&#x7EDF;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x90FD;&#x662F;&#x7531;&#x6211;&#x4EEC;&#x5728;&#x7C7B;&#x5185;&#x90E8;&#x4E3B;&#x52A8;&#x521B;&#x5EFA;&#x4F9D;&#x8D56;&#x5BF9;&#x8C61;&#xFF0C;&#x4ECE;&#x800C;&#x5BFC;&#x81F4;&#x7C7B;&#x4E0E;&#x7C7B;&#x4E4B;&#x95F4;&#x9AD8;&#x8026;&#x5408;&#xFF0C;&#x96BE;&#x4E8E;&#x6D4B;&#x8BD5;&#xFF1B;&#x6709;&#x4E86;IoC&#x5BB9;&#x5668;&#x540E;&#xFF0C;&#x628A;&#x521B;&#x5EFA;&#x548C;&#x67E5;&#x627E;&#x4F9D;&#x8D56;&#x5BF9;&#x8C61;&#x7684;&#x63A7;&#x5236;&#x6743;&#x4EA4;&#x7ED9;&#x4E86;&#x5BB9;&#x5668;&#xFF0C;&#x7531;&#x5BB9;&#x5668;&#x8FDB;&#x884C;&#x6CE8;&#x5165;&#x7EC4;&#x5408;&#x5BF9;&#x8C61;&#xFF0C;&#x6240;&#x4EE5;&#x5BF9;&#x8C61;&#x4E0E;&#x5BF9;&#x8C61;&#x4E4B;&#x95F4;&#x662F; &#x677E;&#x6563;&#x8026;&#x5408;&#xFF0C;&#x8FD9;&#x6837;&#x4E5F;&#x65B9;&#x4FBF;&#x6D4B;&#x8BD5;&#xFF0C;&#x5229;&#x4E8E;&#x529F;&#x80FD;&#x590D;&#x7528;&#xFF0C;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#x4F7F;&#x5F97;&#x7A0B;&#x5E8F;&#x7684;&#x6574;&#x4E2A;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x53D8;&#x5F97;&#x975E;&#x5E38;&#x7075;&#x6D3B;&#x3002;</p><p style="margin:10px auto;font-size:14px;line-height:1.5em;background-color:rgb(255,255,255);font-family:verdana, arial, helvetica, sans-serif;">&#x3000;&#x3000;&#x5176;&#x5B9E;<span style="color:rgb(255,0,0);"><span style="font-weight:700;">IoC&#x5BF9;&#x7F16;&#x7A0B;&#x5E26;&#x6765;&#x7684;&#x6700;&#x5927;&#x6539;&#x53D8;&#x4E0D;&#x662F;&#x4ECE;&#x4EE3;&#x7801;&#x4E0A;&#xFF0C;&#x800C;&#x662F;&#x4ECE;&#x601D;&#x60F3;&#x4E0A;&#xFF0C;&#x53D1;&#x751F;&#x4E86;&#x201C;&#x4E3B;&#x4ECE;&#x6362;&#x4F4D;&#x201D;&#x7684;&#x53D8;&#x5316;&#x3002;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x539F;&#x672C;&#x662F;&#x8001;&#x5927;&#xFF0C;&#x8981;&#x83B7;&#x53D6;&#x4EC0;&#x4E48;&#x8D44;&#x6E90;&#x90FD;&#x662F;&#x4E3B;&#x52A8;&#x51FA;&#x51FB;&#xFF0C;&#x4F46;&#x662F;&#x5728;IoC/DI&#x601D;&#x60F3;&#x4E2D;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5C31;&#x53D8;&#x6210;&#x88AB;&#x52A8;&#x7684;&#x4E86;&#xFF0C;&#x88AB;&#x52A8;&#x7684;&#x7B49;&#x5F85;IoC&#x5BB9;&#x5668;&#x6765;&#x521B;&#x5EFA;&#x5E76;&#x6CE8;&#x5165;&#x5B83;&#x6240;&#x9700;&#x8981;&#x7684;&#x8D44;&#x6E90;&#x4E86;&#x3002;</span></span></p><p style="margin:10px auto;font-size:14px;line-height:1.5em;background-color:rgb(255,255,255);font-family:verdana, arial, helvetica, sans-serif;">&#x3000;&#x3000;<span style="color:rgb(255,0,0);"><span style="font-weight:700;">IoC&#x5F88;&#x597D;&#x7684;&#x4F53;&#x73B0;&#x4E86;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8BBE;&#x8BA1;&#x6CD5;&#x5219;&#x4E4B;&#x4E00;&#x2014;&#x2014; &#x597D;&#x83B1;&#x575E;&#x6CD5;&#x5219;&#xFF1A;&#x201C;&#x522B;&#x627E;&#x6211;&#x4EEC;&#xFF0C;&#x6211;&#x4EEC;&#x627E;&#x4F60;&#x201D;&#xFF1B;&#x5373;&#x7531;IoC&#x5BB9;&#x5668;&#x5E2E;&#x5BF9;&#x8C61;&#x627E;&#x76F8;&#x5E94;&#x7684;&#x4F9D;&#x8D56;&#x5BF9;&#x8C61;&#x5E76;&#x6CE8;&#x5165;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7531;&#x5BF9;&#x8C61;&#x4E3B;&#x52A8;&#x53BB;&#x627E;&#x3002;</span></span></p><h3 style="padding:0px;font-size:16px;line-height:20.8px;background-color:rgb(255,255,255);font-family:Verdana, Geneva, Arial, Helvetica, sans-serif;"><a></a>1.3&#x3001;IoC&#x548C;DI</h3><p style="margin:10px auto;font-size:14px;line-height:1.5em;background-color:rgb(255,255,255);font-family:verdana, arial, helvetica, sans-serif;">&#x3000;&#x3000;<span style="color:rgb(255,0,0);"><span style="font-weight:700;">DI&#x2014;Dependency Injection&#xFF0C;&#x5373;&#x201C;&#x4F9D;&#x8D56;&#x6CE8;&#x5165;&#x201D;</span></span>&#xFF1A;<span style="color:rgb(255,0,0);"><span style="font-weight:700;">&#x7EC4;&#x4EF6;&#x4E4B;&#x95F4;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;</span></span>&#x7531;&#x5BB9;&#x5668;&#x5728;&#x8FD0;&#x884C;&#x671F;&#x51B3;&#x5B9A;&#xFF0C;&#x5F62;&#x8C61;&#x7684;&#x8BF4;&#xFF0C;&#x5373;<span style="color:rgb(255,0,0);"><span style="font-weight:700;">&#x7531;&#x5BB9;&#x5668;&#x52A8;&#x6001;&#x7684;&#x5C06;&#x67D0;&#x4E2A;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x6CE8;&#x5165;&#x5230;&#x7EC4;&#x4EF6;&#x4E4B;&#x4E2D;</span></span>&#x3002;<span style="color:rgb(255,0,0);"><span style="font-weight:700;">&#x4F9D;&#x8D56;&#x6CE8;&#x5165;&#x7684;&#x76EE;&#x7684;&#x5E76;&#x975E;&#x4E3A;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x5E26;&#x6765;&#x66F4;&#x591A;&#x529F;&#x80FD;&#xFF0C;&#x800C;&#x662F;&#x4E3A;&#x4E86;&#x63D0;&#x5347;&#x7EC4;&#x4EF6;&#x91CD;&#x7528;&#x7684;&#x9891;&#x7387;&#xFF0C;&#x5E76;&#x4E3A;&#x7CFB;&#x7EDF;&#x642D;&#x5EFA;&#x4E00;&#x4E2A;&#x7075;&#x6D3B;&#x3001;&#x53EF;&#x6269;&#x5C55;&#x7684;&#x5E73;&#x53F0;&#x3002;</span></span>&#x901A;&#x8FC7;&#x4F9D;&#x8D56;&#x6CE8;&#x5165;&#x673A;&#x5236;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x7B80;&#x5355;&#x7684;&#x914D;&#x7F6E;&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x4EFB;&#x4F55;&#x4EE3;&#x7801;&#x5C31;&#x53EF;&#x6307;&#x5B9A;&#x76EE;&#x6807;&#x9700;&#x8981;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x5B8C;&#x6210;&#x81EA;&#x8EAB;&#x7684;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#xFF0C;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x5173;&#x5FC3;&#x5177;&#x4F53;&#x7684;&#x8D44;&#x6E90;&#x6765;&#x81EA;&#x4F55;&#x5904;&#xFF0C;&#x7531;&#x8C01;&#x5B9E;&#x73B0;&#x3002;</p><p style="margin:10px auto;font-size:14px;line-height:1.5em;background-color:rgb(255,255,255);font-family:verdana, arial, helvetica, sans-serif;">&#x3000;&#x3000;&#x7406;&#x89E3;DI&#x7684;&#x5173;&#x952E;&#x662F;&#xFF1A;&#x201C;&#x8C01;&#x4F9D;&#x8D56;&#x8C01;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x9700;&#x8981;&#x4F9D;&#x8D56;&#xFF0C;&#x8C01;&#x6CE8;&#x5165;&#x8C01;&#xFF0C;&#x6CE8;&#x5165;&#x4E86;&#x4EC0;&#x4E48;&#x201D;&#xFF0C;&#x90A3;&#x6211;&#x4EEC;&#x6765;&#x6DF1;&#x5165;&#x5206;&#x6790;&#x4E00;&#x4E0B;&#xFF1A;</p><p style="margin:10px auto;font-size:14px;line-height:1.5em;background-color:rgb(255,255,255);font-family:verdana, arial, helvetica, sans-serif;">&#x3000;&#x3000;&#x25CF;<span style="line-height:1.5em;padding:0px;margin:0px;">&#x8C01;&#x4F9D;&#x8D56;&#x4E8E;&#x8C01;&#xFF1A;</span>&#x5F53;&#x7136;&#x662F;<span style="color:rgb(255,0,0);"><span style="font-weight:700;">&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4F9D;&#x8D56;&#x4E8E;IoC&#x5BB9;&#x5668;</span></span>&#xFF1B;</p><p style="margin:10px auto;font-size:14px;line-height:1.5em;background-color:rgb(255,255,255);font-family:verdana, arial, helvetica, sans-serif;">&#x3000;&#x3000;&#x25CF;<span style="line-height:1.5em;padding:0px;margin:0px;">&#x4E3A;&#x4EC0;&#x4E48;&#x9700;&#x8981;&#x4F9D;&#x8D56;&#xFF1A;</span><span style="color:rgb(255,0,0);"><span style="font-weight:700;">&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x9700;&#x8981;IoC&#x5BB9;&#x5668;&#x6765;&#x63D0;&#x4F9B;&#x5BF9;&#x8C61;&#x9700;&#x8981;&#x7684;&#x5916;&#x90E8;&#x8D44;&#x6E90;</span></span>&#xFF1B;</p><p style="margin:10px auto;font-size:14px;line-height:1.5em;background-color:rgb(255,255,255);font-family:verdana, arial, helvetica, sans-serif;">&#x3000;&#x3000;&#x25CF;<span style="line-height:1.5em;padding:0px;margin:0px;">&#x8C01;&#x6CE8;&#x5165;&#x8C01;&#xFF1A;</span>&#x5F88;&#x660E;&#x663E;&#x662F;<span style="color:rgb(255,0,0);"><span style="font-weight:700;">IoC&#x5BB9;&#x5668;&#x6CE8;&#x5165;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x67D0;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4F9D;&#x8D56;&#x7684;&#x5BF9;&#x8C61;</span></span>&#xFF1B;</p><p style="margin:10px auto;font-size:14px;line-height:1.5em;background-color:rgb(255,255,255);font-family:verdana, arial, helvetica, sans-serif;"><span style="line-height:1.5em;padding:0px;margin:0px;">&#x3000;&#x3000;&#x25CF;&#x6CE8;&#x5165;&#x4E86;&#x4EC0;&#x4E48;&#xFF1A;</span>&#x5C31;&#x662F;<span style="color:rgb(255,0,0);"><span style="font-weight:700;">&#x6CE8;&#x5165;&#x67D0;&#x4E2A;&#x5BF9;&#x8C61;&#x6240;&#x9700;&#x8981;&#x7684;&#x5916;&#x90E8;&#x8D44;&#x6E90;&#xFF08;&#x5305;&#x62EC;&#x5BF9;&#x8C61;&#x3001;&#x8D44;&#x6E90;&#x3001;&#x5E38;&#x91CF;&#x6570;&#x636E;&#xFF09;</span></span>&#x3002;</p><p style="margin:10px auto;font-size:14px;line-height:1.5em;background-color:rgb(255,255,255);font-family:verdana, arial, helvetica, sans-serif;">&#x3000;&#x3000;<span style="color:rgb(255,0,0);"><span style="font-weight:700;">IoC&#x548C;DI</span></span>&#x7531;&#x4EC0;&#x4E48;<span style="color:rgb(255,0,0);"><span style="font-weight:700;">&#x5173;&#x7CFB;</span></span>&#x5462;&#xFF1F;&#x5176;&#x5B9E;&#x5B83;&#x4EEC;<span style="color:rgb(255,0,0);"><span style="font-weight:700;">&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x6982;&#x5FF5;&#x7684;&#x4E0D;&#x540C;&#x89D2;&#x5EA6;&#x63CF;&#x8FF0;</span></span>&#xFF0C;&#x7531;&#x4E8E;&#x63A7;&#x5236;&#x53CD;&#x8F6C;&#x6982;&#x5FF5;&#x6BD4;&#x8F83;&#x542B;&#x7CCA;&#xFF08;&#x53EF;&#x80FD;&#x53EA;&#x662F;&#x7406;&#x89E3;&#x4E3A;&#x5BB9;&#x5668;&#x63A7;&#x5236;&#x5BF9;&#x8C61;&#x8FD9;&#x4E00;&#x4E2A;&#x5C42;&#x9762;&#xFF0C;&#x5F88;&#x96BE;&#x8BA9;&#x4EBA;&#x60F3;&#x5230;&#x8C01;&#x6765;&#x7EF4;&#x62A4;&#x5BF9;&#x8C61;&#x5173;&#x7CFB;&#xFF09;&#xFF0C;&#x6240;&#x4EE5;2004&#x5E74;&#x5927;&#x5E08;&#x7EA7;&#x4EBA;&#x7269;Martin Fowler&#x53C8;&#x7ED9;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x540D;&#x5B57;&#xFF1A;&#x201C;&#x4F9D;&#x8D56;&#x6CE8;&#x5165;&#x201D;&#xFF0C;&#x76F8;&#x5BF9;IoC &#x800C;&#x8A00;&#xFF0C;<span style="color:rgb(255,0,0);">&#x201C;&#x4F9D;&#x8D56;&#x6CE8;&#x5165;&#x201D;&#x660E;&#x786E;&#x63CF;&#x8FF0;&#x4E86;&#x201C;&#x88AB;&#x6CE8;&#x5165;&#x5BF9;&#x8C61;&#x4F9D;&#x8D56;IoC</span><span style="line-height:1.5em;padding:0px;margin:0px;"><span style="color:rgb(255,0,0);">&#x5BB9;&#x5668;&#x914D;&#x7F6E;&#x4F9D;&#x8D56;&#x5BF9;&#x8C61;&#x201D;</span>&#x3002;</span></p><p style="margin:10px auto;font-size:14px;line-height:1.5em;background-color:rgb(255,255,255);font-family:verdana, arial, helvetica, sans-serif;">&#x3000;&#x3000;&#x770B;&#x8FC7;&#x5F88;&#x591A;&#x5BF9;Spring&#x7684;Ioc&#x7406;&#x89E3;&#x7684;&#x6587;&#x7AE0;&#xFF0C;&#x597D;&#x591A;&#x4EBA;&#x5BF9;Ioc&#x548C;DI&#x7684;&#x89E3;&#x91CA;&#x90FD;&#x6666;&#x6DA9;&#x96BE;&#x61C2;&#xFF0C;&#x53CD;&#x6B63;&#x5C31;&#x662F;&#x4E00;&#x79CD;&#x8BF4;&#x4E0D;&#x6E05;&#xFF0C;&#x9053;&#x4E0D;&#x660E;&#x7684;&#x611F;&#x89C9;&#xFF0C;&#x8BFB;&#x5B8C;&#x4E4B;&#x540E;&#x4F9D;&#x7136;&#x662F;&#x4E00;&#x5934;&#x96FE;&#x6C34;&#xFF0C;&#x611F;&#x89C9;&#x5C31;&#x662F;&#x5F00;&#x6D9B;&#x8FD9;&#x4F4D;&#x6280;&#x672F;&#x725B;&#x4EBA;&#x5199;&#x5F97;&#x7279;&#x522B;&#x901A;&#x4FD7;&#x6613;&#x61C2;&#xFF0C;&#x4ED6;&#x6E05;&#x695A;&#x5730;&#x89E3;&#x91CA;&#x4E86;IoC(&#x63A7;&#x5236;&#x53CD;&#x8F6C;) &#x548C;DI(&#x4F9D;&#x8D56;&#x6CE8;&#x5165;)&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x5B57;&#xFF0C;&#x8BFB;&#x5B8C;&#x4E4B;&#x540E;&#x7ED9;&#x4EBA;&#x4E00;&#x79CD;&#x8C41;&#x7136;&#x5F00;&#x6717;&#x7684;&#x611F;&#x89C9;&#x3002;&#x6211;&#x76F8;&#x4FE1;&#x5BF9;&#x4E8E;&#x521D;&#x5B66;Spring&#x6846;&#x67B6;&#x7684;&#x4EBA;&#x5BF9;Ioc&#x7684;&#x7406;&#x89E3;&#x5E94;&#x8BE5;&#x662F;&#x6709;&#x5F88;&#x5927;&#x5E2E;&#x52A9;&#x7684;&#x3002;</p><h2 style="padding:0px;margin-top:10px;font-size:21px;line-height:20.8px;background-color:rgb(255,255,255);font-family:Verdana, Geneva, Arial, Helvetica, sans-serif;"><a></a>&#x4E8C;&#x3001;&#x5206;&#x4EAB;Bromon&#x7684;blog&#x4E0A;&#x5BF9;IoC&#x4E0E;DI&#x6D45;&#x663E;&#x6613;&#x61C2;&#x7684;&#x8BB2;&#x89E3;</h2><h3 style="padding:0px;font-size:16px;line-height:20.8px;background-color:rgb(255,255,255);font-family:Verdana, Geneva, Arial, Helvetica, sans-serif;"><a></a>2.1&#x3001;IoC(&#x63A7;&#x5236;&#x53CD;&#x8F6C;)</h3><p style="margin:10px auto;font-size:13px;line-height:20.8px;background-color:rgb(255,255,255);font-family:Verdana, Geneva, Arial, Helvetica, sans-serif;">&#x3000;&#x3000;&#x9996;&#x5148;&#x60F3;&#x8BF4;&#x8BF4;<span style="line-height:19.5px;color:rgb(255,0,0);"><span style="font-weight:700;">IoC&#xFF08;Inversion of Control&#xFF0C;&#x63A7;&#x5236;&#x53CD;&#x8F6C;&#xFF09;</span></span>&#x3002;&#x8FD9;&#x662F;<span style="line-height:19.5px;color:rgb(255,0,0);"><span style="font-weight:700;">spring&#x7684;&#x6838;&#x5FC3;</span></span>&#xFF0C;&#x8D2F;&#x7A7F;&#x59CB;&#x7EC8;&#x3002;<span style="line-height:19.5px;color:rgb(255,0,0);"><span style="font-weight:700;">&#x6240;&#x8C13;IoC&#xFF0C;&#x5BF9;&#x4E8E;spring&#x6846;&#x67B6;&#x6765;&#x8BF4;&#xFF0C;&#x5C31;&#x662F;&#x7531;spring&#x6765;&#x8D1F;&#x8D23;&#x63A7;&#x5236;&#x5BF9;&#x8C61;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x548C;&#x5BF9;&#x8C61;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x3002;</span></span>&#x8FD9;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#x5462;&#xFF0C;&#x4E3E;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x6211;&#x4EEC;&#x662F;&#x5982;&#x4F55;&#x627E;&#x5973;&#x670B;&#x53CB;&#x7684;&#xFF1F;&#x5E38;&#x89C1;&#x7684;&#x60C5;&#x51B5;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x5230;&#x5904;&#x53BB;&#x770B;&#x54EA;&#x91CC;&#x6709;&#x957F;&#x5F97;&#x6F02;&#x4EAE;&#x8EAB;&#x6750;&#x53C8;&#x597D;&#x7684;mm&#xFF0C;&#x7136;&#x540E;&#x6253;&#x542C;&#x5979;&#x4EEC;&#x7684;&#x5174;&#x8DA3;&#x7231;&#x597D;&#x3001;qq&#x53F7;&#x3001;&#x7535;&#x8BDD;&#x53F7;&#x3001;ip&#x53F7;&#x3001;iq&#x53F7;&#x2026;&#x2026;&#x2026;&#xFF0C;&#x60F3;&#x529E;&#x6CD5;&#x8BA4;&#x8BC6;&#x5979;&#x4EEC;&#xFF0C;&#x6295;&#x5176;&#x6240;&#x597D;&#x9001;&#x5176;&#x6240;&#x8981;&#xFF0C;&#x7136;&#x540E;&#x563F;&#x563F;&#x2026;&#x2026;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x662F;&#x590D;&#x6742;&#x6DF1;&#x5965;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x81EA;&#x5DF1;&#x8BBE;&#x8BA1;&#x548C;&#x9762;&#x5BF9;&#x6BCF;&#x4E2A;&#x73AF;&#x8282;&#x3002;&#x4F20;&#x7EDF;&#x7684;&#x7A0B;&#x5E8F;&#x5F00;&#x53D1;&#x4E5F;&#x662F;&#x5982;&#x6B64;&#xFF0C;&#x5728;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x8981;&#x4F7F;&#x7528;&#x53E6;&#x5916;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x5C31;&#x5FC5;&#x987B;&#x5F97;&#x5230;&#x5B83;&#xFF08;&#x81EA;&#x5DF1;new&#x4E00;&#x4E2A;&#xFF0C;&#x6216;&#x8005;&#x4ECE;JNDI&#x4E2D;&#x67E5;&#x8BE2;&#x4E00;&#x4E2A;&#xFF09;&#xFF0C;&#x4F7F;&#x7528;&#x5B8C;&#x4E4B;&#x540E;&#x8FD8;&#x8981;&#x5C06;&#x5BF9;&#x8C61;&#x9500;&#x6BC1;&#xFF08;&#x6BD4;&#x5982;Connection&#x7B49;&#xFF09;&#xFF0C;&#x5BF9;&#x8C61;&#x59CB;&#x7EC8;&#x4F1A;&#x548C;&#x5176;&#x4ED6;&#x7684;&#x63A5;&#x53E3;&#x6216;&#x7C7B;&#x85D5;&#x5408;&#x8D77;&#x6765;&#x3002;</p><p style="margin:10px auto;font-size:13px;line-height:20.8px;background-color:rgb(255,255,255);font-family:Verdana, Geneva, Arial, Helvetica, sans-serif;">&#x3000;&#x3000;&#x90A3;&#x4E48;IoC&#x662F;&#x5982;&#x4F55;&#x505A;&#x7684;&#x5462;&#xFF1F;&#x6709;&#x70B9;&#x50CF;&#x901A;&#x8FC7;&#x5A5A;&#x4ECB;&#x627E;&#x5973;&#x670B;&#x53CB;&#xFF0C;&#x5728;&#x6211;&#x548C;&#x5973;&#x670B;&#x53CB;&#x4E4B;&#x95F4;&#x5F15;&#x5165;&#x4E86;&#x4E00;&#x4E2A;&#x7B2C;&#x4E09;&#x8005;&#xFF1A;&#x5A5A;&#x59FB;&#x4ECB;&#x7ECD;&#x6240;&#x3002;&#x5A5A;&#x4ECB;&#x7BA1;&#x7406;&#x4E86;&#x5F88;&#x591A;&#x7537;&#x7537;&#x5973;&#x5973;&#x7684;&#x8D44;&#x6599;&#xFF0C;&#x6211;&#x53EF;&#x4EE5;&#x5411;&#x5A5A;&#x4ECB;&#x63D0;&#x51FA;&#x4E00;&#x4E2A;&#x5217;&#x8868;&#xFF0C;&#x544A;&#x8BC9;&#x5B83;&#x6211;&#x60F3;&#x627E;&#x4E2A;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x5973;&#x670B;&#x53CB;&#xFF0C;&#x6BD4;&#x5982;&#x957F;&#x5F97;&#x50CF;&#x674E;&#x5609;&#x6B23;&#xFF0C;&#x8EAB;&#x6750;&#x50CF;&#x6797;&#x7199;&#x96F7;&#xFF0C;&#x5531;&#x6B4C;&#x50CF;&#x5468;&#x6770;&#x4F26;&#xFF0C;&#x901F;&#x5EA6;&#x50CF;&#x5361;&#x6D1B;&#x65AF;&#xFF0C;&#x6280;&#x672F;&#x50CF;&#x9F50;&#x8FBE;&#x5185;&#x4E4B;&#x7C7B;&#x7684;&#xFF0C;&#x7136;&#x540E;&#x5A5A;&#x4ECB;&#x5C31;&#x4F1A;&#x6309;&#x7167;&#x6211;&#x4EEC;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;mm&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x53BB;&#x548C;&#x5979;&#x8C08;&#x604B;&#x7231;&#x3001;&#x7ED3;&#x5A5A;&#x5C31;&#x884C;&#x4E86;&#x3002;&#x7B80;&#x5355;&#x660E;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x5A5A;&#x4ECB;&#x7ED9;&#x6211;&#x4EEC;&#x7684;&#x4EBA;&#x9009;&#x4E0D;&#x7B26;&#x5408;&#x8981;&#x6C42;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x4F1A;&#x629B;&#x51FA;&#x5F02;&#x5E38;&#x3002;&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E0D;&#x518D;&#x7531;&#x6211;&#x81EA;&#x5DF1;&#x63A7;&#x5236;&#xFF0C;&#x800C;&#x662F;&#x6709;&#x5A5A;&#x4ECB;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x7C7B;&#x4F3C;&#x5BB9;&#x5668;&#x7684;&#x673A;&#x6784;&#x6765;&#x63A7;&#x5236;&#x3002;<span style="line-height:19.5px;color:rgb(255,0,0);"><span style="font-weight:700;">Spring&#x6240;&#x5021;&#x5BFC;&#x7684;&#x5F00;&#x53D1;&#x65B9;&#x5F0F;</span></span>&#x5C31;&#x662F;&#x5982;&#x6B64;&#xFF0C;<span style="line-height:19.5px;color:rgb(255,0,0);"><span style="font-weight:700;">&#x6240;&#x6709;&#x7684;&#x7C7B;&#x90FD;&#x4F1A;&#x5728;spring&#x5BB9;&#x5668;&#x4E2D;&#x767B;&#x8BB0;&#xFF0C;&#x544A;&#x8BC9;spring&#x4F60;&#x662F;&#x4E2A;&#x4EC0;&#x4E48;&#x4E1C;&#x897F;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x4EC0;&#x4E48;&#x4E1C;&#x897F;&#xFF0C;&#x7136;&#x540E;spring&#x4F1A;&#x5728;&#x7CFB;&#x7EDF;&#x8FD0;&#x884C;&#x5230;&#x9002;&#x5F53;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x628A;&#x4F60;&#x8981;&#x7684;&#x4E1C;&#x897F;&#x4E3B;&#x52A8;&#x7ED9;&#x4F60;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x628A;&#x4F60;&#x4EA4;&#x7ED9;&#x5176;&#x4ED6;&#x9700;&#x8981;&#x4F60;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x6240;&#x6709;&#x7684;&#x7C7B;&#x7684;&#x521B;&#x5EFA;&#x3001;&#x9500;&#x6BC1;&#x90FD;&#x7531;&#xA0;spring&#x6765;&#x63A7;&#x5236;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x63A7;&#x5236;&#x5BF9;&#x8C61;&#x751F;&#x5B58;&#x5468;&#x671F;&#x7684;&#x4E0D;&#x518D;&#x662F;&#x5F15;&#x7528;&#x5B83;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x800C;&#x662F;spring&#x3002;&#x5BF9;&#x4E8E;&#x67D0;&#x4E2A;&#x5177;&#x4F53;&#x7684;&#x5BF9;&#x8C61;&#x800C;&#x8A00;&#xFF0C;&#x4EE5;&#x524D;&#x662F;&#x5B83;&#x63A7;&#x5236;&#x5176;&#x4ED6;&#x5BF9;&#x8C61;&#xFF0C;&#x73B0;&#x5728;&#x662F;&#x6240;&#x6709;&#x5BF9;&#x8C61;&#x90FD;&#x88AB;spring&#x63A7;&#x5236;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x53EB;&#x63A7;&#x5236;&#x53CD;&#x8F6C;&#x3002;</span></span></p><h3 style="padding:0px;font-size:16px;line-height:20.8px;background-color:rgb(255,255,255);font-family:Verdana, Geneva, Arial, Helvetica, sans-serif;"><a></a>2.2&#x3001;DI(&#x4F9D;&#x8D56;&#x6CE8;&#x5165;)</h3><p style="margin:10px auto;font-size:13px;line-height:20.8px;background-color:rgb(255,255,255);font-family:Verdana, Geneva, Arial, Helvetica, sans-serif;"><span style="line-height:normal;">&#x3000;&#x3000;<span style="line-height:19.5px;color:rgb(255,0,0);"><span style="font-weight:700;">IoC&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x70B9;&#x662F;&#x5728;&#x7CFB;&#x7EDF;&#x8FD0;&#x884C;&#x4E2D;&#xFF0C;&#x52A8;&#x6001;&#x7684;&#x5411;&#x67D0;&#x4E2A;&#x5BF9;&#x8C61;&#x63D0;&#x4F9B;&#x5B83;&#x6240;&#x9700;&#x8981;&#x7684;&#x5176;&#x4ED6;&#x5BF9;&#x8C61;&#x3002;&#x8FD9;&#x4E00;&#x70B9;&#x662F;&#x901A;&#x8FC7;DI&#xFF08;Dependency Injection&#xFF0C;&#x4F9D;&#x8D56;&#x6CE8;&#x5165;&#xFF09;&#x6765;&#x5B9E;&#x73B0;&#x7684;</span></span>&#x3002;&#x6BD4;&#x5982;&#x5BF9;&#x8C61;A&#x9700;&#x8981;&#x64CD;&#x4F5C;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x4EE5;&#x524D;&#x6211;&#x4EEC;&#x603B;&#x662F;&#x8981;&#x5728;A&#x4E2D;&#x81EA;&#x5DF1;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#x6765;&#x83B7;&#x5F97;&#x4E00;&#x4E2A;Connection&#x5BF9;&#x8C61;&#xFF0C;&#x6709;&#x4E86;&#xA0;spring&#x6211;&#x4EEC;&#x5C31;&#x53EA;&#x9700;&#x8981;&#x544A;&#x8BC9;spring&#xFF0C;A&#x4E2D;&#x9700;&#x8981;&#x4E00;&#x4E2A;Connection&#xFF0C;&#x81F3;&#x4E8E;&#x8FD9;&#x4E2A;Connection&#x600E;&#x4E48;&#x6784;&#x9020;&#xFF0C;&#x4F55;&#x65F6;&#x6784;&#x9020;&#xFF0C;A&#x4E0D;&#x9700;&#x8981;&#x77E5;&#x9053;&#x3002;&#x5728;&#x7CFB;&#x7EDF;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;spring&#x4F1A;&#x5728;&#x9002;&#x5F53;&#x7684;&#x65F6;&#x5019;&#x5236;&#x9020;&#x4E00;&#x4E2A;Connection&#xFF0C;&#x7136;&#x540E;&#x50CF;&#x6253;&#x9488;&#x4E00;&#x6837;&#xFF0C;&#x6CE8;&#x5C04;&#x5230;A&#x5F53;&#x4E2D;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x5B8C;&#x6210;&#x4E86;&#x5BF9;&#x5404;&#x4E2A;&#x5BF9;&#x8C61;&#x4E4B;&#x95F4;&#x5173;&#x7CFB;&#x7684;&#x63A7;&#x5236;&#x3002;A&#x9700;&#x8981;&#x4F9D;&#x8D56;&#xA0;Connection&#x624D;&#x80FD;&#x6B63;&#x5E38;&#x8FD0;&#x884C;&#xFF0C;&#x800C;&#x8FD9;&#x4E2A;Connection&#x662F;&#x7531;spring&#x6CE8;&#x5165;&#x5230;A&#x4E2D;&#x7684;&#xFF0C;&#x4F9D;&#x8D56;&#x6CE8;&#x5165;&#x7684;&#x540D;&#x5B57;&#x5C31;&#x8FD9;&#x4E48;&#x6765;&#x7684;&#x3002;&#x90A3;&#x4E48;DI&#x662F;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x7684;&#x5462;&#xFF1F;&#xA0;Java 1.3&#x4E4B;&#x540E;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7279;&#x5F81;&#x662F;&#x53CD;&#x5C04;&#xFF08;reflection&#xFF09;&#xFF0C;&#x5B83;&#x5141;&#x8BB8;&#x7A0B;&#x5E8F;&#x5728;&#x8FD0;&#x884C;&#x7684;&#x65F6;&#x5019;&#x52A8;&#x6001;&#x7684;&#x751F;&#x6210;&#x5BF9;&#x8C61;&#x3001;&#x6267;&#x884C;&#x5BF9;&#x8C61;&#x7684;&#x65B9;&#x6CD5;&#x3001;&#x6539;&#x53D8;&#x5BF9;&#x8C61;&#x7684;&#x5C5E;&#x6027;&#xFF0C;spring&#x5C31;&#x662F;&#x901A;&#x8FC7;&#x53CD;&#x5C04;&#x6765;&#x5B9E;&#x73B0;&#x6CE8;&#x5165;&#x7684;&#x3002;</span></p><p style="margin:10px auto;font-size:13px;line-height:20.8px;background-color:rgb(255,255,255);font-family:Verdana, Geneva, Arial, Helvetica, sans-serif;"><span style="line-height:normal;">&#x3000;&#x3000;&#x7406;&#x89E3;&#x4E86;IoC&#x548C;DI&#x7684;&#x6982;&#x5FF5;&#x540E;&#xFF0C;&#x4E00;&#x5207;&#x90FD;&#x5C06;&#x53D8;&#x5F97;&#x7B80;&#x5355;&#x660E;&#x4E86;&#xFF0C;&#x5269;&#x4E0B;&#x7684;&#x5DE5;&#x4F5C;&#x53EA;&#x662F;&#x5728;spring&#x7684;&#x6846;&#x67B6;&#x4E2D;&#x5806;&#x79EF;&#x6728;&#x800C;&#x5DF2;&#x3002;</span></p><h2 style="padding:0px;margin-top:10px;font-size:21px;line-height:20.8px;background-color:rgb(255,255,255);font-family:Verdana, Geneva, Arial, Helvetica, sans-serif;"><a></a><span style="line-height:normal;">&#x4E09;&#x3001;&#x6211;&#x5BF9;IoC<span style="line-height:31.5px;color:rgb(255,0,0);"><span><span style="line-height:normal;"><span style="line-height:31.5px;">(&#x63A7;&#x5236;&#x53CD;&#x8F6C;)</span></span></span></span>&#x548C;DI<span style="line-height:31.5px;color:rgb(255,0,0);"><span><span style="line-height:normal;"><span style="line-height:31.5px;">(&#x4F9D;&#x8D56;&#x6CE8;&#x5165;)</span></span></span></span>&#x7684;&#x7406;&#x89E3;</span></h2><p style="margin:10px auto;font-size:13px;line-height:20.8px;background-color:rgb(255,255,255);font-family:Verdana, Geneva, Arial, Helvetica, sans-serif;"><span style="line-height:normal;">&#x3000;&#x3000;&#x5728;&#x5E73;&#x65F6;&#x7684;java&#x5E94;&#x7528;&#x5F00;&#x53D1;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x5B9E;&#x73B0;&#x67D0;&#x4E00;&#x4E2A;&#x529F;&#x80FD;&#x6216;&#x8005;&#x8BF4;&#x662F;&#x5B8C;&#x6210;&#x67D0;&#x4E2A;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x65F6;&#x81F3;&#x5C11;&#x9700;&#x8981;&#x4E24;&#x4E2A;&#x6216;&#x4EE5;&#x4E0A;&#x7684;&#x5BF9;&#x8C61;&#x6765;&#x534F;&#x4F5C;&#x5B8C;&#x6210;&#xFF0C;&#x5728;&#x6CA1;&#x6709;&#x4F7F;&#x7528;Spring&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6BCF;&#x4E2A;&#x5BF9;&#x8C61;&#x5728;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x4ED6;&#x7684;&#x5408;&#x4F5C;&#x5BF9;&#x8C61;&#x65F6;&#xFF0C;&#x81EA;&#x5DF1;&#x5747;&#x8981;&#x4F7F;&#x7528;&#x50CF;new object() &#x8FD9;&#x6837;&#x7684;&#x8BED;&#x6CD5;&#x6765;&#x5C06;&#x5408;&#x4F5C;&#x5BF9;&#x8C61;&#x521B;&#x5EFA;&#x51FA;&#x6765;&#xFF0C;&#x8FD9;&#x4E2A;&#x5408;&#x4F5C;&#x5BF9;&#x8C61;&#x662F;&#x7531;&#x81EA;&#x5DF1;&#x4E3B;&#x52A8;&#x521B;&#x5EFA;&#x51FA;&#x6765;&#x7684;&#xFF0C;&#x521B;&#x5EFA;&#x5408;&#x4F5C;&#x5BF9;&#x8C61;&#x7684;&#x4E3B;&#x52A8;&#x6743;&#x5728;&#x81EA;&#x5DF1;&#x624B;&#x4E0A;&#xFF0C;&#x81EA;&#x5DF1;&#x9700;&#x8981;&#x54EA;&#x4E2A;&#x5408;&#x4F5C;&#x5BF9;&#x8C61;&#xFF0C;&#x5C31;&#x4E3B;&#x52A8;&#x53BB;&#x521B;&#x5EFA;&#xFF0C;&#x521B;&#x5EFA;&#x5408;&#x4F5C;&#x5BF9;&#x8C61;&#x7684;&#x4E3B;&#x52A8;&#x6743;&#x548C;&#x521B;&#x5EFA;&#x65F6;&#x673A;&#x662F;&#x7531;&#x81EA;&#x5DF1;&#x628A;&#x63A7;&#x7684;&#xFF0C;&#x800C;&#x8FD9;&#x6837;&#x5C31;&#x4F1A;&#x4F7F;&#x5F97;&#x5BF9;&#x8C61;&#x95F4;&#x7684;&#x8026;&#x5408;&#x5EA6;&#x9AD8;&#x4E86;&#xFF0C;A&#x5BF9;&#x8C61;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x5408;&#x4F5C;&#x5BF9;&#x8C61;B&#x6765;&#x5171;&#x540C;&#x5B8C;&#x6210;&#x4E00;&#x4EF6;&#x4E8B;&#xFF0C;A&#x8981;&#x4F7F;&#x7528;B&#xFF0C;&#x90A3;&#x4E48;A&#x5C31;&#x5BF9;B&#x4EA7;&#x751F;&#x4E86;&#x4F9D;&#x8D56;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;A&#x548C;B&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x4E00;&#x79CD;&#x8026;&#x5408;&#x5173;&#x7CFB;&#xFF0C;&#x5E76;&#x4E14;&#x662F;&#x7D27;&#x5BC6;&#x8026;&#x5408;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x800C;&#x4F7F;&#x7528;&#x4E86;Spring&#x4E4B;&#x540E;&#x5C31;&#x4E0D;&#x4E00;&#x6837;&#x4E86;&#xFF0C;&#x521B;&#x5EFA;&#x5408;&#x4F5C;&#x5BF9;&#x8C61;B&#x7684;&#x5DE5;&#x4F5C;&#x662F;&#x7531;Spring&#x6765;&#x505A;&#x7684;&#xFF0C;Spring&#x521B;&#x5EFA;&#x597D;B&#x5BF9;&#x8C61;&#xFF0C;&#x7136;&#x540E;&#x5B58;&#x50A8;&#x5230;&#x4E00;&#x4E2A;&#x5BB9;&#x5668;&#x91CC;&#x9762;&#xFF0C;&#x5F53;A&#x5BF9;&#x8C61;&#x9700;&#x8981;&#x4F7F;&#x7528;B&#x5BF9;&#x8C61;&#x65F6;&#xFF0C;Spring&#x5C31;&#x4ECE;&#x5B58;&#x653E;&#x5BF9;&#x8C61;&#x7684;&#x90A3;&#x4E2A;&#x5BB9;&#x5668;&#x91CC;&#x9762;&#x53D6;&#x51FA;A&#x8981;&#x4F7F;&#x7528;&#x7684;&#x90A3;&#x4E2A;B&#x5BF9;&#x8C61;&#xFF0C;&#x7136;&#x540E;&#x4EA4;&#x7ED9;A&#x5BF9;&#x8C61;&#x4F7F;&#x7528;&#xFF0C;&#x81F3;&#x4E8E;Spring&#x662F;&#x5982;&#x4F55;&#x521B;&#x5EFA;&#x90A3;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x4EE5;&#x53CA;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x521B;&#x5EFA;&#x597D;&#x5BF9;&#x8C61;&#x7684;&#xFF0C;A&#x5BF9;&#x8C61;&#x4E0D;&#x9700;&#x8981;&#x5173;&#x5FC3;&#x8FD9;&#x4E9B;&#x7EC6;&#x8282;&#x95EE;&#x9898;(&#x4F60;&#x662F;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x751F;&#x7684;&#xFF0C;&#x600E;&#x4E48;&#x751F;&#x51FA;&#x6765;&#x7684;&#x6211;&#x53EF;&#x4E0D;&#x5173;&#x5FC3;&#xFF0C;&#x80FD;&#x5E2E;&#x6211;&#x5E72;&#x6D3B;&#x5C31;&#x884C;)&#xFF0C;A&#x5F97;&#x5230;Spring&#x7ED9;&#x6211;&#x4EEC;&#x7684;&#x5BF9;&#x8C61;&#x4E4B;&#x540E;&#xFF0C;&#x4E24;&#x4E2A;&#x4EBA;&#x4E00;&#x8D77;&#x534F;&#x4F5C;&#x5B8C;&#x6210;&#x8981;&#x5B8C;&#x6210;&#x7684;&#x5DE5;&#x4F5C;&#x5373;&#x53EF;&#x3002;</span></p><p style="margin:10px auto;font-size:13px;line-height:20.8px;background-color:rgb(255,255,255);font-family:Verdana, Geneva, Arial, Helvetica, sans-serif;"><span style="line-height:normal;">&#x3000;&#x3000;&#x6240;&#x4EE5;<span style="line-height:19.5px;color:rgb(255,0,0);"><span style="font-weight:700;">&#x63A7;&#x5236;&#x53CD;&#x8F6C;IoC(Inversion of Control)&#x662F;&#x8BF4;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x7684;&#x63A7;&#x5236;&#x6743;&#x8FDB;&#x884C;&#x8F6C;&#x79FB;&#xFF0C;&#x4EE5;&#x524D;<span style="line-height:normal;">&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x7684;&#x4E3B;&#x52A8;&#x6743;&#x548C;&#x521B;&#x5EFA;&#x65F6;&#x673A;&#x662F;&#x7531;&#x81EA;&#x5DF1;&#x628A;&#x63A7;&#x7684;</span>&#xFF0C;&#x800C;&#x73B0;&#x5728;&#x8FD9;&#x79CD;&#x6743;&#x529B;&#x8F6C;&#x79FB;&#x5230;&#x7B2C;&#x4E09;&#x65B9;</span></span>&#xFF0C;&#x6BD4;&#x5982;&#x8F6C;&#x79FB;&#x4EA4;&#x7ED9;&#x4E86;IoC&#x5BB9;&#x5668;&#xFF0C;&#x5B83;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x4E13;&#x95E8;&#x7528;&#x6765;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x7684;&#x5DE5;&#x5382;&#xFF0C;&#x4F60;&#x8981;&#x4EC0;&#x4E48;&#x5BF9;&#x8C61;&#xFF0C;&#x5B83;&#x5C31;&#x7ED9;&#x4F60;&#x4EC0;&#x4E48;&#x5BF9;&#x8C61;&#xFF0C;&#x6709;&#x4E86; IoC&#x5BB9;&#x5668;&#xFF0C;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x5C31;&#x53D8;&#x4E86;&#xFF0C;&#x539F;&#x5148;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x5C31;&#x6CA1;&#x4E86;&#xFF0C;&#x5B83;&#x4EEC;&#x90FD;&#x4F9D;&#x8D56;IoC&#x5BB9;&#x5668;&#x4E86;&#xFF0C;&#x901A;&#x8FC7;IoC&#x5BB9;&#x5668;&#x6765;&#x5EFA;&#x7ACB;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x3002;</span></p><p style="margin:10px auto;font-size:13px;line-height:20.8px;background-color:rgb(255,255,255);font-family:Verdana, Geneva, Arial, Helvetica, sans-serif;">&#x3000;&#x3000;&#x8FD9;&#x662F;&#x6211;&#x5BF9;Spring&#x7684;IoC<span style="line-height:19.5px;color:rgb(255,0,0);"><span style="font-weight:700;">(&#x63A7;&#x5236;&#x53CD;&#x8F6C;)</span></span>&#x7684;&#x7406;&#x89E3;&#x3002;DI<span style="line-height:19.5px;color:rgb(255,0,0);"><span style="font-weight:700;">(&#x4F9D;&#x8D56;&#x6CE8;&#x5165;)</span></span>&#x5176;&#x5B9E;&#x5C31;&#x662F;IOC&#x7684;&#x53E6;&#x5916;&#x4E00;&#x79CD;&#x8BF4;&#x6CD5;&#xFF0C;DI&#x662F;&#x7531;Martin Fowler &#x5728;2004&#x5E74;&#x521D;&#x7684;&#x4E00;&#x7BC7;&#x8BBA;&#x6587;&#x4E2D;&#x9996;&#x6B21;&#x63D0;&#x51FA;&#x7684;&#x3002;&#x4ED6;&#x603B;&#x7ED3;&#xFF1A;<span style="line-height:19.5px;color:rgb(255,0,0);"><span style="font-weight:700;"><span style="line-height:normal;">&#x63A7;&#x5236;&#x7684;&#x4EC0;&#x4E48;&#x88AB;&#x53CD;&#x8F6C;&#x4E86;&#xFF1F;&#x5C31;&#x662F;&#xFF1A;&#x83B7;&#x5F97;&#x4F9D;&#x8D56;&#x5BF9;&#x8C61;&#x7684;&#x65B9;&#x5F0F;&#x53CD;&#x8F6C;&#x4E86;&#x3002;</span></span></span></p><h2 style="padding:0px;margin-top:10px;font-size:21px;line-height:20.8px;background-color:rgb(255,255,255);font-family:Verdana, Geneva, Arial, Helvetica, sans-serif;"><a></a>&#x56DB;&#x3001;&#x5C0F;&#x7ED3;</h2><p style="margin:10px auto;font-size:13px;line-height:20.8px;background-color:rgb(255,255,255);font-family:Verdana, Geneva, Arial, Helvetica, sans-serif;">&#x3000;&#x3000;&#x5BF9;&#x4E8E;Spring Ioc&#x8FD9;&#x4E2A;&#x6838;&#x5FC3;&#x6982;&#x5FF5;&#xFF0C;&#x6211;&#x76F8;&#x4FE1;&#x6BCF;&#x4E00;&#x4E2A;&#x5B66;&#x4E60;Spring&#x7684;&#x4EBA;&#x90FD;&#x4F1A;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x7406;&#x89E3;&#x3002;&#x8FD9;&#x79CD;&#x6982;&#x5FF5;&#x4E0A;&#x7684;&#x7406;&#x89E3;&#x6CA1;&#x6709;&#x7EDD;&#x5BF9;&#x7684;&#x6807;&#x51C6;&#x7B54;&#x6848;&#xFF0C;&#x4EC1;&#x8005;&#x89C1;&#x4EC1;&#x667A;&#x8005;&#x89C1;&#x667A;&#x3002;&#x5982;&#x679C;&#x6709;&#x7406;&#x89E3;&#x4E0D;&#x5230;&#x4F4D;&#x6216;&#x8005;&#x7406;&#x89E3;&#x9519;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x6B22;&#x8FCE;&#x5E7F;&#x5927;&#x56ED;&#x53CB;&#x6307;&#x6B63;&#xFF01;</p><br>                                    