
                    <!-- flowchart 箭头图标 勿删 -->
                    <svg xmlns="http://www.w3.org/2000/svg" style="display: none;">
                        <path stroke-linecap="round" d="M5,0 0,2.5 5,5z" id="raphael-marker-block" style="-webkit-tap-highlight-color: rgba(0, 0, 0, 0);"/>
                    </svg>
                                            <p>&#x5982;&#x4F55;&#x7406;&#x89E3;hash(&#x53C8;&#x540D;&#x54C8;&#x5E0C;&#xFF0C;&#x6216;&#x8005;&#x6563;&#x5217;)</p>
<h4><a id="hash_2"></a>&#x5B9E;&#x73B0;hash&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x793A;&#x610F;&#x56FE;</h4>
<p><img src="https://images2015.cnblogs.com/blog/380239/201707/380239-20170722204733918-1744201106.png" alt="&#x5728;&#x8FD9;&#x91CC;&#x63D2;&#x5165;&#x56FE;&#x7247;&#x63CF;&#x8FF0;"></p>
<p>&#x7531;&#x56FE;&#x53EF;&#x77E5;&#xFF0C;&#x54C8;&#x5E0C;&#x8868;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x4E00;&#x7EF4;&#x6570;&#x7EC4;&#xFF0C;&#x800C;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x5355;&#x5411;&#x94FE;&#x8868;&#x800C;&#x5DF2;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;<strong>&#x89E3;&#x51B3;&#x4E86;&#x6570;&#x7EC4;&#x7684;&#x589E;&#x5220;&#x5143;&#x7D20;&#x7684;&#x4E0D;&#x8DB3;&#x548C;&#x94FE;&#x8868;&#x7684;&#x67E5;&#x8BE2;&#x6548;&#x7387;&#x7684;&#x4E0D;&#x8DB3;</strong>&#x3002;</p>
<h4><a id="_7"></a>&#x54C8;&#x5E0C;&#x539F;&#x7406;</h4>
<p>&#x901A;&#x8FC7;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#xFF08;md4 md5 sha1 &#x2026;&#xFF09;&#x5C06;&#x4EFB;&#x610F;&#x957F;&#x5EA6;&#x7684;&#x6570;&#x636E;&#x6620;&#x5C04;&#x6210;&#x56FA;&#x5B9A;&#x957F;&#x5EA6;&#xFF0C;&#x8F83;&#x5C11;&#x4F4D;&#x6570;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x6570;&#x636E;&#x3002;&#x4EE5;&#x6620;&#x5C04;&#x540E;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x6570;&#x636E;&#x4E3A;&#x4F9D;&#x636E;&#x8FDB;&#x884C;&#x5B58;&#x50A8;&#xFF0C;&#x6784;&#x9020;&#x6210;&#x54C8;&#x5E0C;&#x8868;&#x3002;&#x5728;&#x540E;&#x7EED;&#x67E5;&#x627E;&#x65F6;&#xFF0C;&#x4E5F;&#x662F;&#x6839;&#x636E;&#x539F;&#x6765;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x6570;&#x636E;&#xFF0C;&#x548C;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#xFF0C;&#x8BA1;&#x7B97;&#x51FA;&#x4E00;&#x4E2A;&#x4E8C;&#x8FDB;&#x5236;&#x6570;&#x636E;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x54C8;&#x5E0C;&#x8868;&#x4E2D;&#x627E;&#x5230;&#x8BA1;&#x7B97;&#x5F97;&#x5230;&#x90A3;&#x4E2A;&#x4E8C;&#x8FDB;&#x5236;&#x6570;&#x636E;&#x3002;&#x627E;&#x5230;&#x4E4B;&#x540E;&#xFF0C;&#x5728;&#x6309;&#x7167;&#x4F9D;&#x636E;&#x7684;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x8FDB;&#x884C;&#x53CD;&#x64CD;&#x4F5C;&#xFF0C;&#x5373;&#x53EF;&#x5F97;&#x5230;&#x539F;&#x59CB;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x6570;&#x636E;&#x3002;</p>
<h4><a id="_11"></a>&#x54C8;&#x5E0C;&#x8FC7;&#x7A0B;</h4>
<p>&#x6574;&#x4E2A;&#x6563;&#x5217;&#x8FC7;&#x7A0B;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x4E24;&#x6B65;&#x3002;(1) &#x5728;&#x5B58;&#x50A8;&#x65F6;&#xFF0C;&#x901A;&#x8FC7;&#x6563;&#x5217;&#x51FD;&#x6570;&#x8BA1;&#x7B97;&#x8BB0;&#x5F55;&#x7684;&#x6563;&#x5217;&#x5730;&#x5740;&#xFF0C;&#x5E76;&#x6309;&#x6B64;&#x6563;&#x5217;&#x5730;&#x5740;&#x5B58;&#x50A8;&#x8BE5;&#x8BB0;&#x5F55;&#x3002;(2) &#x5F53;&#x67E5;&#x627E;&#x8BB0;&#x5F55;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x540C;&#x6837;&#x7684;&#x6563;&#x5217;&#x51FD;&#x6570;&#x8BA1;&#x7B97;&#x8BB0;&#x5F55;&#x7684;&#x6563;&#x5217;&#x5730;&#x5740;&#xFF0C;&#x6309;&#x6B64;&#x6563;&#x5217;&#x5730;&#x5740;&#x8BBF;&#x95EE;&#x8BE5;&#x8BB0;&#x5F55;&#x3002;&#x7531;&#x4E8E;&#x5B58;&#x53D6;&#x7528;&#x7684;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x6563;&#x5217;&#x51FD;&#x6570;&#xFF0C; &#x56E0;&#x6B64;&#x7ED3;&#x679C;&#x5F53;&#x7136;&#x4E5F;&#x662F;&#x76F8;&#x540C;&#x7684;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x8BF4;&#xFF0C;&#x6563;&#x5217;&#x6280;&#x672F;&#x65E2;&#x662F;&#x4E00;&#x79CD;&#x5B58;&#x50A8;&#x65B9;&#x6CD5;&#xFF0C;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x67E5;&#x627E;&#x65B9;&#x6CD5;&#x3002;&#x7136;&#x800C;&#x5B83;&#x4E0E;&#x7EBF;&#x6027;&#x8868;&#x3001;&#x6811;&#x3001;&#x56FE;&#x7B49;&#x7ED3;&#x6784;&#x4E0D;&#x540C;&#x7684;&#x662F;&#xFF0C;&#x524D;&#x9762;&#x51E0;&#x79CD;&#x7ED3;&#x6784;&#xFF0C;&#x6570;&#x636E;&#x5143;&#x7D20;&#x4E4B;&#x95F4;&#x90FD;&#x5B58;&#x5728;&#x67D0;&#x79CD;&#x903B;&#x8F91;&#x5173;&#x7CFB;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x8FDE;&#x7EBF;&#x56FE;&#x793A;&#x8868;&#x793A;&#x51FA;&#x6765;&#xFF0C;&#x800C;&#x6563;&#x5217;&#x6280;&#x672F;&#x7684;&#x8BB0;&#x5F55;&#x4E4B;&#x95F4;&#x4E0D;&#x5B58;&#x5728;&#x4EC0;&#x4E48;&#x903B;&#x8F91;&#x5173;&#x7CFB;&#xFF0C;&#x5B83;&#x53EA;&#x4E0E;&#x5173;&#x952E;&#x5B57;&#x6709;&#x5173;&#x8054;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6563;&#x5217;&#x4E3B;&#x8981;&#x662F;&#x9762;&#x5411;&#x67E5;&#x627E;&#x7684;&#x5B58;&#x50A8;&#x7ED3;&#x6784;&#x3002;</p>
<h4><a id="_17"></a>&#x54C8;&#x5E0C;&#x4F18;&#x70B9;</h4>
<p>1&#xFF0C;&#x8282;&#x7EA6;&#x7A7A;&#x95F4;&#x3002;&#x54C8;&#x5E0C;&#x4E4B;&#x540E;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x6570;&#x636E;&#x4F4D;&#x6570;&#x66F4;&#x5C11;&#xFF0C;&#x8282;&#x7EA6;&#x7A7A;&#x95F4;&#xFF1B;</p>
<p>2&#xFF0C;&#x67E5;&#x627E;&#x5FEB;&#x901F;&#x3002;&#x6839;&#x636E;&#x5F97;&#x5230;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x67E5;&#x627E;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x7C7B;&#x4F3C;&#x4E8E;&#x6839;&#x636E;&#x6570;&#x7EC4;&#x4E0B;&#x6807;&#x6765;&#x67E5;&#x627E;&#xFF0C;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x662F;o(1)&#xFF1B;&#x4F46;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x7684;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x5F80;&#x5F80;&#x4F1A;&#x5927;&#x4E8E;o(1)&#xFF0C;&#x56E0;&#x4E3A;&#x54C8;&#x5E0C;&#x4E4B;&#x540E;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x6570;&#x636E;&#x53EF;&#x80FD;&#x5BF9;&#x5E94;&#x4E8E;&#x591A;&#x4E2A;&#x539F;&#x59CB;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x53EB;&#x505A;&#x54C8;&#x5E0C;&#x51B2;&#x7A81;&#xFF1B;</p>
<h4><a id="_23"></a>&#x89E3;&#x51B3;&#x54C8;&#x5E0C;&#x51B2;&#x7A81;&#x7684;&#x65B9;&#x6CD5;</h4>
<p>1&#xFF0C;&#x7EBF;&#x6027;&#x63A2;&#x6D4B;&#xFF1A;&#x5C06;&#x54C8;&#x5E0C;&#x503C;&#x76F8;&#x540C;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4EE5;&#x94FE;&#x8868;&#x7684;&#x5F62;&#x5F0F;&#x5B58;&#x50A8;&#xFF0C;&#x5373;&#x5148;&#x901A;&#x8FC7;&#x54C8;&#x5E0C;&#x503C;&#x9501;&#x5B9A;&#x8303;&#x56F4;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x4F9D;&#x6B21;&#x89E3;&#x6790;&#x51FA;&#x539F;&#x59CB;&#x6570;&#x636E;&#xFF0C;&#x8FDB;&#x884C;&#x67E5;&#x627E;&#xFF1B;</p>
<p>2&#xFF0C;&#x8FDE;&#x5730;&#x5740;&#x6CD5;&#xFF1A;&#x5373;&#x5728;&#x5206;&#x914D;&#x54C8;&#x5E0C;&#x8868;&#x65F6;&#xFF0C;&#x591A;&#x5206;&#x914D;&#x4E00;&#x4E9B;&#x7A7A;&#x95F4;&#xFF0C;&#x5BF9;&#x4E8E;&#x54C8;&#x5E0C;&#x51B2;&#x7A81;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5728;&#x54C8;&#x5E0C;&#x8868;&#x4E2D;&#x4F9D;&#x6B21;&#x8BB0;&#x5F55;&#x3002;</p>
<p>&#x5982;&#x4F55;&#x8BBE;&#x7F6E;&#x9700;&#x8981;&#x5206;&#x914D;&#x7684;&#x54C8;&#x5E0C;&#x8868;&#x7684;&#x5927;&#x5C0F;&#xFF1A;</p>
<p>&#x5728;&#x4F7F;&#x7528;&#x54C8;&#x5E0C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8981;&#x8003;&#x8651;&#x4F60;&#x5B58;&#x7684;&#x6570;&#x636E;&#x4E2A;&#x6570;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x786E;&#x5B9A;&#x6570;&#x7EC4;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x4E00;&#x822C;&#x6570;&#x7EC4;&#x7684;&#x5927;&#x5C0F;&#x662F;&#x6570;&#x636E;&#x4E2A;&#x6570;&#x7684;&#x4E24;&#x500D;&#xFF08;&#x597D;&#x50CF;&#xFF09;&#x3002;</p>
<h4><a id="_33"></a>&#x54C8;&#x5E0C;&#x5E94;&#x7528;</h4>
<p>&#xFF08;1&#xFF09; &#x6587;&#x4EF6;&#x6821;&#x9A8C;</p>
<p>&#x6211;&#x4EEC;&#x6BD4;&#x8F83;&#x719F;&#x6089;&#x7684;&#x6821;&#x9A8C;&#x7B97;&#x6CD5;&#x6709;&#x5947;&#x5076;&#x6821;&#x9A8C;&#x548C;CRC&#x6821;&#x9A8C;&#xFF0C;&#x8FD9;2&#x79CD;&#x6821;&#x9A8C;&#x5E76;&#x6CA1;&#x6709;&#x6297;&#x6570;&#x636E;&#x7BE1;&#x6539;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x5B83;&#x4EEC;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x80FD;&#x68C0;&#x6D4B;&#x5E76;&#x7EA0;&#x6B63;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x4E2D;&#x7684;&#x4FE1;&#x9053;&#x8BEF;&#x7801;&#xFF0C;&#x4F46;&#x5374;&#x4E0D;&#x80FD;&#x9632;&#x6B62;&#x5BF9;&#x6570;&#x636E;&#x7684;&#x6076;&#x610F;&#x7834;&#x574F;&#x3002;</p>
<p>MD5 Hash&#x7B97;&#x6CD5;&#x7684;&#x201C;&#x6570;&#x5B57;&#x6307;&#x7EB9;&#x201D;&#x7279;&#x6027;&#xFF0C;&#x4F7F;&#x5B83;&#x6210;&#x4E3A;&#x76EE;&#x524D;&#x5E94;&#x7528;&#x6700;&#x5E7F;&#x6CDB;&#x7684;&#x4E00;&#x79CD;&#x6587;&#x4EF6;&#x5B8C;&#x6574;&#x6027;&#x6821;&#x9A8C;&#x548C;&#xFF08;Checksum&#xFF09;&#x7B97;&#x6CD5;&#xFF0C;&#x4E0D;&#x5C11;Unix&#x7CFB;&#x7EDF;&#x6709;&#x63D0;&#x4F9B;&#x8BA1;&#x7B97;md5 checksum&#x7684;&#x547D;&#x4EE4;&#x3002;</p>
<p>&#xFF08;2&#xFF09; &#x6570;&#x5B57;&#x7B7E;&#x540D;</p>
<p>Hash &#x7B97;&#x6CD5;&#x4E5F;&#x662F;&#x73B0;&#x4EE3;&#x5BC6;&#x7801;&#x4F53;&#x7CFB;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#x3002;&#x7531;&#x4E8E;&#x975E;&#x5BF9;&#x79F0;&#x7B97;&#x6CD5;&#x7684;&#x8FD0;&#x7B97;&#x901F;&#x5EA6;&#x8F83;&#x6162;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x534F;&#x8BAE;&#x4E2D;&#xFF0C;&#x5355;&#x5411;&#x6563;&#x5217;&#x51FD;&#x6570;&#x626E;&#x6F14;&#x4E86;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x89D2;&#x8272;&#x3002; &#x5BF9; Hash &#x503C;&#xFF0C;&#x53C8;&#x79F0;&#x201C;&#x6570;&#x5B57;&#x6458;&#x8981;&#x201D;&#x8FDB;&#x884C;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#xFF0C;&#x5728;&#x7EDF;&#x8BA1;&#x4E0A;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x4E0E;&#x5BF9;&#x6587;&#x4EF6;&#x672C;&#x8EAB;&#x8FDB;&#x884C;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x662F;&#x7B49;&#x6548;&#x7684;&#x3002;&#x800C;&#x4E14;&#x8FD9;&#x6837;&#x7684;&#x534F;&#x8BAE;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x7684;&#x4F18;&#x70B9;&#x3002;</p>
<p>&#xFF08;3&#xFF09; &#x9274;&#x6743;&#x534F;&#x8BAE;</p>
<p>&#x5982;&#x4E0B;&#x7684;&#x9274;&#x6743;&#x534F;&#x8BAE;&#x53C8;&#x88AB;&#x79F0;&#x4F5C;&#x6311;&#x6218;&#x2013;&#x8BA4;&#x8BC1;&#x6A21;&#x5F0F;&#xFF1A;&#x5728;&#x4F20;&#x8F93;&#x4FE1;&#x9053;&#x662F;&#x53EF;&#x88AB;&#x4FA6;&#x542C;&#xFF0C;&#x4F46;&#x4E0D;&#x53EF;&#x88AB;&#x7BE1;&#x6539;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x7B80;&#x5355;&#x800C;&#x5B89;&#x5168;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>

                                    