
                    <!-- flowchart 箭头图标 勿删 -->
                    <svg xmlns="http://www.w3.org/2000/svg" style="display: none;">
                        <path stroke-linecap="round" d="M5,0 0,2.5 5,5z" id="raphael-marker-block" style="-webkit-tap-highlight-color: rgba(0, 0, 0, 0);"/>
                    </svg>
                                            <p>&#x5199;&#x5728;&#x524D;&#x9762;&#xFF1A;&#x672C;&#x6587;&#x4E0D;&#x4F1A;&#x8BB2;cd pwd mv cp touch mkdir&#x8FD9;&#x79CD;&#x65B0;&#x624B;&#x901A;&#x7528;&#x547D;&#x4EE4;&#xFF0C;&#x4E3B;&#x8981;&#x8BB2;&#x89E3;&#x5728;&#x670D;&#x52A1;&#x5668;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x7ECF;&#x5E38;&#x4F7F;&#x7528;&#x5230;&#x7684;&#x4E00;&#x4E9B;&#x547D;&#x4EE4;</p>
<p>&#x6B63;&#x6587;&#xFF1A;</p>
<h2><a id="1_4"></a>1&#x3001;&#x8FDB;&#x7A0B;/&#x7EBF;&#x7A0B;&#x76D1;&#x63A7;&#x76F8;&#x5173;</h2>
<h4><a id="ps_6"></a>ps&#xFF1A;</h4>
<p>&#x67E5;&#x770B;&#x7CFB;&#x7EDF;&#x8FDB;&#x7A0B;/&#x7EBF;&#x7A0B;&#xFF0C;&#x4E00;&#x822C;&#x5355;&#x72EC;&#x91C7;&#x7528;&#x6B64;&#x547D;&#x4EE4;&#x67E5;&#x627E;&#x8FDB;&#x7A0B;id&#xFF0C;&#x7136;&#x540E;&#x6839;&#x636E;&#x8FDB;&#x7A0B;id&#x505A;&#x8FDB;&#x4E00;&#x6B65;&#x5DE5;&#x4F5C;&#x3002;&#x5E38;&#x89C1;&#x7528;&#x6CD5;&#xFF1A;ps -aux &#x67E5;&#x770B;&#x6240;&#x6709;&#x8FDB;&#x7A0B;<br>
ps -T -p ${pid} &#x67E5;&#x770B;&#x67D0;&#x4E2A;&#x8FDB;&#x7A0B;&#x7684;&#x7EBF;&#x7A0B;</p>
<h4><a id="pstree_11"></a>pstree&#xFF1A;</h4>
<p>&#x6253;&#x5370;&#x7CFB;&#x7EDF;&#x8FDB;&#x7A0B;&#x6811;&#xFF0C;&#x7528;&#x6811;&#x5F62;&#x7ED3;&#x6784;&#x6807;&#x8BC6;&#x5404;&#x4E2A;&#x8FDB;&#x7A0B;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x3002;&#x5E38;&#x89C1;&#x7528;&#x6CD5;&#xFF1A;pstree</p>
<h4><a id="top_15"></a>top&#xFF1A;</h4>
<p>&#x67E5;&#x770B;&#x7CFB;&#x7EDF;&#x8FDB;&#x7A0B;/&#x7EBF;&#x7A0B;&#x8FD0;&#x884C;&#x60C5;&#x51B5;&#xFF0C;&#x5373;&#x8FDB;&#x7A0B;/&#x7EBF;&#x7A0B;&#x6240;&#x5360;&#x7528;&#x8D44;&#x6E90;&#x7684;&#x60C5;&#x51B5;&#x3001;&#x8D1F;&#x8F7D;&#x7684;&#x60C5;&#x51B5;&#x3001;&#x4EE5;&#x53CA;cpu&#x7684;&#x53D8;&#x5316;&#x60C5;&#x51B5;&#xFF0C;&#x4ECE;&#x800C;&#x5224;&#x65AD;&#x5176;&#x8FD0;&#x884C;&#x72B6;&#x6001;&#x662F;&#x5426;&#x6B63;&#x5E38;&#x3002;&#x540C;&#x4E0A;&#x9762;&#x7684;ps&#x547D;&#x4EE4;&#xFF0C;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x8F93;&#x51FA;&#x4FE1;&#x606F;&#x4E2D;&#x7684;&#x8FDB;&#x7A0B;/&#x7EBF;&#x7A0B;id&#xFF0C;&#x8FDB;&#x884C;&#x9488;&#x5BF9;&#x6027;&#x67E5;&#x627E;&#x3002;&#x5E38;&#x89C1;&#x7528;&#x6CD5;&#xFF1A;top &#x5217;&#x51FA;&#x6240;&#x6709;&#x7EBF;&#x7A0B;&#x8D1F;&#x8F7D;&#x4FE1;&#x606F; top -H &#x5217;&#x51FA;&#x6240;&#x6709;&#x7EBF;&#x7A0B;&#x7684;&#x8D1F;&#x8F7D;&#x4FE1;&#x606F; top -H -p ${pid} &#x5217;&#x51FA;&#x67D0;&#x4E2A;pid&#x4E0B;&#x6240;&#x6709;&#x7EBF;&#x7A0B;&#x7684;&#x8D1F;&#x8F7D;&#x4FE1;&#x606F;</p>
<h4><a id="free_19"></a>free&#xFF1A;</h4>
<p>&#x67E5;&#x770B;&#x5185;&#x5B58;&#x53CA;&#x4F7F;&#x7528;&#x60C5;&#x51B5;&#x3002;&#x5E38;&#x89C1;&#x7528;&#x6CD5;&#xFF1A;free</p>
<h2><a id="2_23"></a>2&#x3001;&#x6587;&#x4EF6;&#x64CD;&#x4F5C;&#x76F8;&#x5173;</h2>
<h4><a id="cat_25"></a>cat&#xFF1A;</h4>
<p>&#x67E5;&#x770B;&#x6587;&#x4EF6;&#x5185;&#x5BB9;&#xFF0C;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x8BE5;&#x547D;&#x4EE4;&#x4F1A;&#x628A;&#x6574;&#x4E2A;&#x6587;&#x4EF6;&#x8F93;&#x51FA;&#x5230;&#x7EC8;&#x7AEF;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x6587;&#x4EF6;&#x5185;&#x5BB9;&#x975E;&#x5E38;&#x591A;&#x3002;&#x5E38;&#x89C1;&#x7528;&#x6CD5;&#xFF1A;cat file.txt</p>
<h4><a id="tail_29"></a>tail&#xFF1A;</h4>
<p>&#x67E5;&#x770B;&#x67D0;&#x4E2A;&#x6587;&#x4EF6;&#x7684;&#x5C3E;&#x90E8;&#xFF0C;&#x6216;&#x8005;&#x67E5;&#x770B;&#x6807;&#x51C6;&#x51FA;&#x5165;&#x7684;&#x6700;&#x672B;&#x5C3E;&#xFF0C;&#x9ED8;&#x8BA4;&#x503C;&#x663E;&#x793A;10&#x884C;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;-n&#x53C2;&#x6570;&#x6765;&#x6307;&#x5B9A;&#x8F93;&#x51FA;&#x591A;&#x5C11;&#x884C;&#x3002;&#x5E38;&#x89C1;&#x7528;&#x6CD5;&#xFF1A;</p>
<p>tail -n 100 file.txt &#x8F93;&#x51FA;&#x6700;&#x672B;&#x5C3E;&#x7684;100&#x884C; tail -f file.txt &#x968F;&#x7740;&#x6587;&#x4EF6;&#x65B0;&#x589E;&#xFF0C;&#x6301;&#x7EED;&#x8F93;&#x51FA;&#x65B0;&#x589E;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x6B64;&#x7EC4;&#x5408;&#x7ECF;&#x5E38;&#x5728;&#x67E5;&#x770B;&#x670D;&#x52A1;&#x5668;&#x6253;&#x5370;&#x65E5;&#x5FD7;&#x7684;&#x573A;&#x666F;&#x4E0B;&#x4F7F;&#x7528;&#xFF0C;&#x53EF;&#x4EE5;&#x914D;&#x5408;grep&#x547D;&#x4EE4;&#xFF0C;&#x8FC7;&#x6EE4;&#x9700;&#x8981;&#x7684;&#x4FE1;&#x606F;&#x3002;</p>
<h4><a id="head_35"></a>head&#xFF1A;</h4>
<p>&#x67E5;&#x770B;&#x67D0;&#x4E2A;&#x6587;&#x4EF6;&#x7684;&#x5934;&#x90E8;&#xFF0C;&#x4E5F;&#x662F;&#x9ED8;&#x8BA4;&#x663E;&#x793A;10&#x884C;&#xFF0C;&#x5E38;&#x89C1;&#x7528;&#x6CD5;&#xFF1A;head -n 100 file.txt &#x6253;&#x5370;&#x6587;&#x4EF6;&#x6700;&#x5F00;&#x59CB;&#x7684;100&#x884C;</p>
<h4><a id="more_39"></a>more&#xFF1A;</h4>
<p>&#x7528;&#x6765;&#x67E5;&#x770B;&#x6587;&#x4EF6;&#xFF0C;&#x95EE;&#x9898;&#x662F;more&#x547D;&#x4EE4;&#x53EA;&#x52A0;&#x8F7D;&#x4E00;&#x5C4F;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x4F46;&#x53EF;&#x4EE5;&#x5411;&#x4E0B;&#x7FFB;&#x52A8;&#x3002;&#x5BF9;&#x4E8E;&#x5927;&#x6587;&#x4EF6;&#x6765;&#x8BF4;&#xFF0C;&#x5176;&#x8FD0;&#x884C;&#x901F;&#x5EA6;&#x6BD4;cat&#x5FEB;&#x591A;&#x4E86;&#x3002;&#x5E38;&#x89C1;&#x7528;&#x6CD5;<br>
more file.txt</p>
<h4><a id="less_44"></a>less&#xFF1A;</h4>
<p>&#x5927;&#x4F53;&#x4E0A;&#x548C;more&#x7C7B;&#x4F3C;&#xFF0C;&#x591A;&#x4E86;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x5411;&#x4E0A;&#x7FFB;&#x52A8;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x6BD4;more&#x5E38;&#x7528;&#x3002;&#x5E38;&#x89C1;&#x7528;&#x6CD5;&#xFF1A;less file.txt</p>
<h4><a id="grep_48"></a>grep&#xFF1A;</h4>
<p>&#x8FC7;&#x6EE4;&#x547D;&#x4EE4;&#x3002;&#x8FD9;&#x4E2A;&#x547D;&#x4EE4;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x7528;&#x7684;&#x6700;&#x5E7F;&#x6CDB;&#x7684;&#x4E86;&#xFF0C;&#x5176;&#x8FC7;&#x6EE4;&#x548C;&#x7B5B;&#x9009;&#x80FD;&#x529B;&#x5F02;&#x5E38;&#x5F3A;&#x5927;&#xFF0C;&#x652F;&#x6301;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#x3002;&#x5E38;&#x89C1;&#x7528;&#x6CD5;&#xFF1A;grep &#x201C;abc&#x201D; file &#x4ECE;file&#x4E2D;&#x7B5B;&#x9009;&#x51FA;&#x5305;&#x542B; abc&#x7684;&#x884C;&#x3002;</p>
<h4><a id="awk_52"></a>awk&#xFF1A;</h4>
<p>&#x7EDF;&#x8BA1;&#x547D;&#x4EE4;&#x3002;&#x5F53;&#x6587;&#x4EF6;&#x6709;&#x591A;&#x5217;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x91C7;&#x7528;awk&#x8F93;&#x51FA;&#x5177;&#x4F53;&#x67D0;&#x51E0;&#x5217;&#xFF0C;&#x6216;&#x8005;&#x505A;&#x4E00;&#x4E9B;&#x7B80;&#x5355;&#x7684;&#x7EDF;&#x8BA1;&#xFF0C;&#x4F8B;&#x5982;&#x6C42;&#x548C;&#xFF0C;&#x6C42;&#x5E73;&#x5747;&#x503C;&#x7B49;&#x7B49;&#xFF0C;&#x518D;&#x6216;&#x8005;&#x505A;&#x4E00;&#x4E0B;&#x7B80;&#x5355;&#x7684;&#x6570;&#x636E;&#x683C;&#x5F0F;&#x5316;&#x3002;&#x5E38;&#x89C1;&#x7528;&#x6CD5;&#xFF1A;<br>
cat data | awk &#x2018;{print $1,$3,$5}&#x2019; &#x8F93;&#x51FA;&#x7B2C;1 3 5&#x5217;&#xFF0C;&#x6CE8;&#x610F;&#x4E0B;&#x6807;&#x662F;&#x4ECE;1&#x5F00;&#x59CB;<br>
cat data | awk &#x2018;{ sum += $1 } END { print sum }&#x2019; &#x5BF9;&#x7B2C;&#x4E00;&#x5217;&#x6C42;&#x548C;<br>
cat data | awk -F&#x2019;\t&#x2019; &#x2018;{print $1,$3}&#x2019; &#x628A;&#x6BCF;&#x884C;&#x6570;&#x636E;&#x6309;tab&#x5206;&#x5217;&#xFF0C;&#x5E76;&#x8F93;&#x51FA;1 3&#x5217;</p>
<h4><a id="sort_59"></a>sort&#xFF1A;</h4>
<p>&#x6392;&#x5E8F;&#x547D;&#x4EE4;&#x3002;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#x7BA1;&#x9053;&#x7684;&#x4E00;&#x4E2A;&#x73AF;&#x8282;&#xFF0C;&#x5728;&#x6B64;&#x73AF;&#x8282;&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x6392;&#x5E8F;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x53C2;&#x6570;&#x8BBE;&#x7F6E;&#x6392;&#x5E8F;&#x7B56;&#x7565;&#x3002;&#x5E38;&#x89C1;&#x7528;&#x6CD5;&#xFF1A;<br>
cat file|sort &#x628A;file&#x91CC;&#x7684;&#x6570;&#x636E;&#x6392;&#x5E8F;&#xFF0C;&#x6CE8;&#x610F;&#x662F;&#x6309;&#x5B57;&#x5178;&#x5E8F;&#x6392;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x60F3;&#x6309;&#x6570;&#x503C;&#x6392;&#xFF0C;&#x9700;&#x8981;&#x80FD;&#x591F;&#x52A0;-n&#x53C2;&#x6570;<br>
cat file|sort -k2 -n -r &#x6309;&#x7B2C;&#x4E8C;&#x5217; &#x6570;&#x503C; &#x5012;&#x5E8F; &#x6392;&#x5E8F;&#xFF0C;-k&#x6307;&#x5B9A;&#x7B2C;&#x51E0;&#x5217;&#xFF0C;-r&#x662F;&#x7FFB;&#x8F6C;reverse&#x7684;&#x610F;&#x601D;</p>
<h4><a id="uniq_65"></a>uniq&#xFF1A;</h4>
<p>&#x53BB;&#x91CD;&#x547D;&#x4EE4;&#x3002;&#x5BF9;&#x6392;&#x5E8F;&#x597D;&#x7684;&#x5185;&#x5BB9;&#x53BB;&#x91CD;&#xFF0C;&#x6CE8;&#x610F;&#x5B83;&#x53EA;&#x662F;&#x628A;&#x76F8;&#x90BB;&#x4E14;&#x76F8;&#x540C;&#x7684;&#x53BB;&#x91CD;&#xFF0C;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x60F3;&#x8981;&#x5168;&#x5C40;&#x53BB;&#x91CD;&#xFF0C;&#x9700;&#x8981;&#x5148;&#x7528;sort&#x6392;&#x5E8F;&#x3002;&#x5E38;&#x89C1;&#x7528;&#x6CD5;&#xFF1A;<br>
cat file|sort|uniq &#x628A;file&#x91CC;&#x7684;&#x6587;&#x4EF6;&#x6392;&#x5E8F;&#x5E76;&#x53BB;&#x91CD;<br>
cat file|sort|uniq -c &#x628A;file&#x91CC;&#x7684;&#x6587;&#x4EF6;&#x6392;&#x5E8F;&#x5E76;&#x53BB;&#x91CD;&#xFF0C;&#x4E14;&#x8F93;&#x51FA;&#x6BCF;&#x884C;&#x51FA;&#x73B0;&#x7684;&#x6B21;&#x6570;</p>
<h2><a id="3_71"></a>3&#x3001;&#x8FD0;&#x7EF4;&#x76F8;&#x5173;</h2>
<p>parallel&#xFF1A;<br>
&#x5E76;&#x884C;&#x547D;&#x4EE4;&#x3002;linux&#x5927;&#x90E8;&#x5206;&#x547D;&#x4EE4;&#x90FD;&#x662F;&#x5355;&#x8FDB;&#x7A0B;&#x7684;&#xFF0C;&#x8FD9;&#x4E2A;&#x547D;&#x4EE4;&#x53EF;&#x4EE5;&#x8BA9;&#x5176;&#x4ED6;&#x547D;&#x4EE4;&#x591A;&#x8FDB;&#x7A0B;&#x6267;&#x884C;&#x3002;</p>
<p>scp&#xFF1A;<br>
&#x4E4B;&#x524D;&#x8FD0;&#x7EF4;&#x5927;&#x91CF;&#x673A;&#x5668;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x901A;&#x5E38;&#x9700;&#x8981;&#x6279;&#x91CF;&#x4FEE;&#x6539;&#x67D0;&#x4E2A;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#xFF0C;&#x90FD;&#x662F;&#x5728;&#x4E00;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#x6539;&#x597D;&#xFF0C;&#x7136;&#x540E;&#x7528;scp&#x811A;&#x672C;&#x5206;&#x53D1;&#x5230;&#x5176;&#x4ED6;&#x673A;&#x5668;&#x4E0A;&#x53BB;&#x7684;&#xFF0C;&#x5927;&#x5927;&#x63D0;&#x9AD8;&#x6548;&#x7387;&#x3002;&#x5E38;&#x89C1;&#x7528;&#x6CD5;&#xFF1A;<br>
scp aaa.txt <a href="mailto:test@192.168.1.3" rel="nofollow" data-token="2f619cb4bf2c947033a14292e78976ef">test@192.168.1.3</a>:/tmp/ &#x628A;&#x5F53;&#x524D;&#x76EE;&#x5F55;&#x4E0B;&#x7684;aaa.txt&#x6587;&#x4EF6;&#x901A;&#x8FC7;192.168.1.3&#x4E0A;&#x7684;test&#x8D26;&#x53F7;&#x653E;&#x5230;/tmp&#x76EE;&#x5F55;&#x4E0B;<br>
scp <a href="mailto:test@192.168.1.3" rel="nofollow" data-token="2f619cb4bf2c947033a14292e78976ef">test@192.168.1.3</a>:/tmp/aaa.txt . &#x548C;&#x4E0A;&#x4E00;&#x6761;&#x76F8;&#x53CD;</p>
<h2><a id="4IO_81"></a>4&#x3001;&#x78C1;&#x76D8;&#x53CA;IO&#x76F8;&#x5173;</h2>
<h4><a id="du_83"></a>du&#xFF1A;</h4>
<p>&#x67E5;&#x770B;&#x76EE;&#x5F55;&#x5927;&#x5C0F;&#xFF0C;&#x9ED8;&#x8BA4;&#x8F93;&#x51FA;&#x6B64;&#x76EE;&#x5F55;&#x4E0B;&#x6240;&#x6709;&#x76EE;&#x5F55;&#x7684;&#x5927;&#x5C0F;&#x3002;&#x5E38;&#x89C1;&#x7528;&#x6CD5;&#xFF1A;du -h --max-depth=1 &#x8F93;&#x51FA;&#x6700;&#x6DF1;1&#x5C42;&#x7684;&#x76EE;&#x5F55;&#xFF0C;&#x7136;&#x540E;&#x6587;&#x4EF6;&#x5927;&#x5C0F;&#x7528;&#x4EBA;&#x7C7B;&#x53EF;&#x8BFB;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x6BD4;&#x5982;1K 234M 2G</p>
<h4><a id="df_87"></a>df&#xFF1A;</h4>
<p>&#x67E5;&#x770B;&#x78C1;&#x76D8;&#x5927;&#x5C0F;&#x548C;&#x5360;&#x7528;&#x60C5;&#x51B5;&#xFF0C;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x6574;&#x4E2A;&#x78C1;&#x76D8;&#x5206;&#x533A;&#x7684;&#x72B6;&#x6001;&#x3002;&#x5E38;&#x89C1;&#x7528;&#x6CD5;&#xFF1A;df -h &#x67E5;&#x770B;&#x5404;&#x4E2A;&#x5206;&#x533A;&#x7684;&#x5927;&#x5C0F;&#x548C;&#x4F7F;&#x7528;&#x60C5;&#x51B5;</p>
<h4><a id="iostat_91"></a>iostat&#xFF1A;</h4>
<p>&#x67E5;&#x770B;&#x78C1;&#x76D8;&#x7684;io&#x72B6;&#x6001;</p>
<h4><a id="iotop_95"></a>iotop&#xFF1A;</h4>
<p>&#x53EF;&#x4EE5;&#x7C7B;&#x4F3C;&#x4E8E;top&#x76EE;&#x5F55;&#x4E00;&#x6837;&#xFF0C;&#x5B9E;&#x65F6;&#x663E;&#x793A;&#x5404;&#x4E2A;&#x8FDB;&#x7A0B;&#x7684;io&#x72B6;&#x6001;&#x3002;</p>
<h4><a id="find_99"></a>find&#xFF1A;</h4>
<p>&#x67E5;&#x627E;&#x6587;&#x4EF6;&#x3002;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x5177;&#x4F53;&#x6761;&#x4EF6;&#x8FDB;&#x884C;&#x67E5;&#x627E;&#xFF0C;&#x5305;&#x62EC;&#x6587;&#x4EF6;&#x540D;&#xFF0C;&#x6587;&#x4EF6;&#x65E5;&#x671F;&#xFF0C;&#x6587;&#x4EF6;&#x5927;&#x5C0F;&#x7B49;&#x7B49;&#x3002;&#x5728;&#x670D;&#x52A1;&#x5668;&#x7EF4;&#x62A4;&#x9886;&#x57DF;&#x6709;&#x4E00;&#x4E2A;&#x5F88;&#x5E38;&#x89C1;&#x7684;&#x573A;&#x666F;&#xFF0C;&#x6BD4;&#x5982;&#x5220;&#x9664;&#x7B26;&#x5408;&#x67D0;&#x4E00;&#x6761;&#x4EF6;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x8BE5;&#x547D;&#x4EE4;&#x914D;&#x5408;&#x7279;&#x5B9A;&#x53C2;&#x6570;&#x6765;&#x5B9E;&#x73B0;&#x3002;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;find&#x52A0;xargs&#x547D;&#x4EE4;&#x505A;&#x7684;</p>
<p>&#x5E38;&#x89C1;&#x7528;&#x6CD5;&#xFF1A;<br>
find /home/test -iname &quot;test.txt &#x5728;/home/test/&#x4E0B;&#x627E;&#x6587;&#x4EF6;&#x540D;&#x4E3A;test.txt&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x4E5F;&#x652F;&#x6301;&#x901A;&#x914D;&#x7B26;<br>
find /home/test -isize +100M &#x67E5;&#x627E;/home/test&#x4E0B;&#x5927;&#x4E8E;100M&#x7684;&#x6587;&#x4EF6;</p>
<h4><a id="locate_107"></a>locate&#xFF1A;</h4>
<p>&#x5B9A;&#x4F4D;&#x67D0;&#x4E2A;&#x5177;&#x4F53;&#x6587;&#x4EF6;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;locate&#x547D;&#x4EE4;&#x8981;&#x6BD4;find -name&#x5FEB;&#x5F97;&#x591A;&#xFF0C;&#x539F;&#x56E0;&#x662F;&#x5B83;&#x4E0D;&#x641C;&#x7D22;&#x5177;&#x4F53;&#x76EE;&#x5F55;&#xFF0C;&#x800C;&#x662F;&#x641C;&#x7D22;&#x6570;&#x636E;&#x5E93;/var/lib/mlocate/mlocate.db&#xFF0C;&#x8FD9;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x4F1A;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;cron&#x5B9A;&#x65F6;&#x66F4;&#x65B0;&#xFF0C;&#x6240;&#x4EE5;&#x6709;&#x53EF;&#x80FD;&#x65B0;&#x5EFA;&#x7684;&#x6587;&#x4EF6;&#x4F1A;&#x68C0;&#x7D22;&#x4E0D;&#x5230;&#x3002;&#x6BD4;&#x8F83;&#x7C7B;&#x4F3C;&#x4E0E;&#x5728;windows&#x7CFB;&#x7EDF;&#x4E2D;&#x7ECF;&#x5E38;&#x4F7F;&#x7528;&#x5230;&#x7684;everything&#x5DE5;&#x5177;&#x3002;</p>
<p>&#x5E38;&#x89C1;&#x7528;&#x6CD5;&#xFF1A;locate a.txt &#x5B9A;&#x4F4D;a.txt&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x5982;&#x679C;&#x7CFB;&#x7EDF;&#x4E2D;&#x6709;&#x591A;&#x4E2A;a.txt&#xFF0C;&#x4F1A;&#x5168;&#x90E8;&#x663E;&#x793A;&#x51FA;&#x6765;&#x3002;</p>
<h4><a id="tree_113"></a>tree&#xFF1A;</h4>
<p>&#x5C06;&#x76EE;&#x5F55;&#x7ED3;&#x6784;&#x4EE5;&#x6811;&#x72B6;&#x5F62;&#x5F0F;&#x5448;&#x73B0;&#x3002;&#x5E38;&#x89C1;&#x7528;&#x6CD5;&#xFF1A;tree -L 2 &#x53EA;&#x663E;&#x793A;&#x4E24;&#x5C42;&#x6811;&#x72B6;&#x7ED3;&#x6784;</p>
<h2><a id="5_117"></a>5&#x3001;&#x7F51;&#x7EDC;&#x76F8;&#x5173;</h2>
<h4><a id="ping_119"></a>ping&#xFF1A;</h4>
<p>&#x67E5;&#x770B;&#x7F51;&#x7EDC;&#x662F;&#x5426;&#x901A;&#x3002;&#x5E38;&#x89C1;&#x7528;&#x6CD5;&#xFF1A;ping <a href="http://www.baidu.com" rel="nofollow" data-token="f93bb994e58cb0b759c45584de26be4a">www.baidu.com</a></p>
<h4><a id="nc_123"></a>nc&#xFF1A;</h4>
<p>netcat&#x547D;&#x4EE4;&#x7684;&#x7B80;&#x5199;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x770B;&#x8FDC;&#x7A0B;&#x67D0;&#x4E2A;&#x7AEF;&#x53E3;&#x662F;&#x5426;&#x6253;&#x5F00;&#xFF0C;&#x529F;&#x80FD;&#x5F88;&#x5F3A;&#x5927;&#x3002;</p>
<p>&#x5E38;&#x89C1;&#x7528;&#x6CD5;&#xFF1A;nc -z <a href="http://xindoo.me" rel="nofollow" data-token="f9fde285f66e3fb049ca2c05bc09d5b3">xindoo.me</a> 443 &#x68C0;&#x6D4B;&#x6211;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x7684;443&#x7AEF;&#x53E3;&#x662F;&#x5426;&#x5F00;&#x653E;&#xFF08;&#x5F53;&#x7136;&#x662F;&#x5F00;&#x7684;&#xFF09;</p>
<h4><a id="route_129"></a>route&#xFF1A;</h4>
<p>&#x8DEF;&#x7531;&#x64CD;&#x4F5C;&#x3002;&#x5E38;&#x89C1;&#x7528;&#x6CD5;&#xFF1A;route &#x5217;&#x51FA;&#x672C;&#x5730;&#x8DEF;&#x7531;&#x8868; route add &#x2026; route delete &#x2026;</p>
<h4><a id="netstat_133"></a>netstat&#xFF1A;</h4>
<p>&#x67E5;&#x770B;&#x672C;&#x673A;&#x7684;&#x7F51;&#x7EDC;&#x72B6;&#x6001;&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x7AEF;&#x53E3;&#x5360;&#x7528;&#x60C5;&#x51B5;&#x548C;&#x7F51;&#x7EDC;&#x94FE;&#x63A5;&#x60C5;&#x51B5;&#x3002;&#x5E38;&#x89C1;&#x7528;&#x6CD5;&#xFF1A;netstat -antp</p>
<h4><a id="traceroute_137"></a>traceroute&#xFF1A;</h4>
<p>&#x67E5;&#x770B;&#x4E00;&#x4E2A;&#x8BF7;&#x6C42;&#x5230;&#x76EE;&#x6807;&#x670D;&#x52A1;&#x5668;&#x6240;&#x7ECF;&#x8FC7;&#x7684;&#x6240;&#x6709;&#x8DEF;&#x7531;&#x8282;&#x70B9;&#xFF0C;&#x4E00;&#x822C;&#x7528;&#x6765;&#x6392;&#x67E5;&#x7F51;&#x7EDC;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x5E38;&#x89C1;&#x7528;&#x6CD5;&#xFF1A;traceroute <a href="http://www.baidu.com" rel="nofollow" data-token="f93bb994e58cb0b759c45584de26be4a">www.baidu.com</a></p>
<h4><a id="iftop_143"></a>iftop&#xFF1A;</h4>
<p>&#x67E5;&#x770B;&#x5B9E;&#x65F6;&#x7F51;&#x7EDC;io&#x60C5;&#x51B5;</p>
<h4><a id="lsof_147"></a>lsof&#xFF1A;</h4>
<p>&#x67E5;&#x770B;&#x7AEF;&#x53E3;&#x5360;&#x7528;</p>
<h4><a id="dig_151"></a>dig&#xFF1A;</h4>
<p>&#x57DF;&#x540D;&#x4FE1;&#x606F;&#x67E5;&#x770B;&#x547D;&#x4EE4;&#x3002;&#x5728;&#x670D;&#x52A1;&#x5668;&#x8FD0;&#x7EF4;&#x9886;&#x57DF;&#xFF0C;&#x7ECF;&#x5E38;&#x9700;&#x8981;&#x9A8C;&#x8BC1;&#x67D0;&#x4E2A;&#x57DF;&#x540D;&#x89E3;&#x6790;&#x6539;&#x52A8;&#x662F;&#x5426;&#x751F;&#x6548;&#xFF0C;&#x4F46;&#x7531;&#x4E8E;&#x4E00;&#x4E2A;&#x57DF;&#x540D;&#x4F1A;&#x7ED1;&#x5B9A;&#x5728;&#x591A;&#x4E2A;ip&#x4E0A;&#xFF0C;&#x800C;&#x7528;ping&#x547D;&#x4EE4;&#x53EA;&#x80FD;&#x770B;&#x5230;&#x4E00;&#x4E2A;ip&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x5C31;&#x9700;&#x8981;&#x7528;dig&#x6765;&#x770B;&#x57DF;&#x540D;&#x89E3;&#x6790;&#x4FE1;&#x606F;&#x4E86;&#x3002;</p>
<p>&#x5E38;&#x89C1;&#x7528;&#x6CD5;&#xFF1A;dig <a href="http://www.baidu.com" rel="nofollow" data-token="f93bb994e58cb0b759c45584de26be4a">www.baidu.com</a></p>
<h4><a id="curl_157"></a>curl&#xFF1A;</h4>
<p>&#x53D1;&#x8D77;http&#x8BF7;&#x6C42;&#x547D;&#x4EE4;&#x3002;&#x4E00;&#x822C;&#x90FD;&#x662F;&#x7528;&#x8FD9;&#x4E2A;&#x547D;&#x4EE4;&#x6765;&#x9A8C;&#x8BC1;&#x670D;&#x52A1;&#x662F;&#x5426;&#x80FD;&#x6B63;&#x5E38;&#x8BBF;&#x95EE;&#x7684;&#xFF0C;&#x5B83;&#x6709;&#x83B7;&#x53D6;html&#x6E90;&#x7801;&#x7684;&#x529F;&#x80FD;&#x3002;</p>
<p>&#x5E38;&#x89C1;&#x7528;&#x6CD5;&#xFF1A;curl <a href="http://www.baidu.com" rel="nofollow" data-token="f93bb994e58cb0b759c45584de26be4a">www.baidu.com</a>  &#x83B7;&#x53D6;biadu.com&#x7684;html&#x6587;&#x4EF6;  curl -I <a href="http://www.baidu.com" rel="nofollow" data-token="f93bb994e58cb0b759c45584de26be4a">www.baidu.com</a> &#x83B7;&#x53D6;&#x8BF7;&#x6C42;baidu.com&#x7684;&#x8BF7;&#x6C42;&#x5934;</p>
<h4><a id="wget_163"></a>wget&#xFF1A;</h4>
<p>&#x7F51;&#x7EDC;&#x4E0B;&#x8F7D;&#x547D;&#x4EE4;&#x3002;&#x53EF;&#x4EE5;&#x5F53;&#x4F5C;&#x547D;&#x4EE4;&#x884C;&#x7248;&#x672C;&#x7684;&#x4E0B;&#x8F7D;&#x5DE5;&#x5177;&#x3002;&#x5E38;&#x89C1;&#x7528;&#x6CD5;&#xFF1A;wget <a href="http://xindoo.me/test.txt" rel="nofollow" data-token="6ec6ecb22bae58101cf422da4e335f9f">xindoo.me/test.txt</a> &#x628A;&#x6211;&#x670D;&#x52A1;&#x5668;&#x4E0A;test.txt&#x6587;&#x4EF6;&#x4E0B;&#x8F7D;&#x5230;&#x672C;&#x5730;</p>
<h2><a id="6_167"></a>6&#x3001;&#x7CFB;&#x7EDF;&#x76F8;&#x5173;</h2>
<h4><a id="yumaptbrew_install_169"></a>yum|apt|brew install&#xFF1A;</h4>
<p>Linux&#x5E73;&#x53F0;&#x7684;&#x5305;&#x7BA1;&#x7406;&#x5DE5;&#x5177;&#x3002;&#x53EF;&#x4EE5;&#x7528;&#x8FD9;&#x4E2A;&#x547D;&#x4EE4;&#x5B89;&#x88C5;&#x6240;&#x9700;&#x8F6F;&#x4EF6;&#x3002;yum&#x662F;Fedora&#x548C;RedHat&#x4EE5;&#x53CA;CentOS&#x4E2D;&#x7684;Shell&#x524D;&#x7AEF;&#x8F6F;&#x4EF6;&#x5305;&#x7BA1;&#x7406;&#x5668;&#xFF0C; apt&#x662F;ubuntu&#x5E73;&#x53F0;&#x4E0A;&#x7684;&#x3002;mac&#x4E0A;&#x7684;&#x662F;brew&#x3002;&#x5E38;&#x89C1;&#x7528;&#x6CD5;&#xFF1A;yum install curl   apt install curl</p>
<h4><a id="man_173"></a>man&#xFF1A;</h4>
<p>&#x5E2E;&#x52A9;&#x624B;&#x518C;&#x3002;&#x53EF;&#x4EE5;&#x67E5;&#x770B;&#x5177;&#x4F53;&#x67D0;&#x4E2A;&#x547D;&#x4EE4;&#x7684;&#x8BE6;&#x7EC6;&#x4F5C;&#x7528;&#xFF0C;&#x548C;&#x5177;&#x4F53;&#x53C2;&#x6570;&#x3002;&#x6B64;&#x547D;&#x4EE4;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x6BD4;&#x5404;&#x547D;&#x4EE4;&#x81EA;&#x5E26;&#x7684;&#x2013;help&#x8BE6;&#x7EC6;&#x5F88;&#x591A;&#x3002;</p>
<p>&#x5E38;&#x89C1;&#x7528;&#x6CD5;&#xFF1A;man curl &#x67E5;&#x770B;curl&#x547D;&#x4EE4;&#x7684;&#x624B;&#x518C;&#x3002;</p>

                                    